module.exports = {
    "idoims": [
        {
            "idiom": "宽宏大量",
            "explain": "形容度量大，能容人。"
        },
        {
            "idiom": "落井下石",
            "explain": "看见人要掉进陷井里，不伸手救他，反而推他下去，又扔下石头。比喻乘人有危难时加以陷害。"
        },
        {
            "idiom": "一石二鸟",
            "explain": "扔一颗石子打到两只鸟。比喻做一件事情得到两种好处。"
        },
        {
            "idiom": "鸡飞蛋打",
            "explain": "鸡飞走了，蛋打破了。比喻两头落空，一无所得。"
        },
        {
            "idiom": "三头六臂",
            "explain": "三个脑袋，六条胳臂。原为佛家语，指佛的法相。后比喻神奇的本领。"
        },
        {
            "idiom": "倾国倾城",
            "explain": "倾：倾覆；城：国。原指因女色而亡国。后多形容妇女容貌极美。"
        },
        {
            "idiom": "无与伦比",
            "explain": "伦比：类比，匹敌。指事物非常完美，没有能跟它相比的。"
        },
        {
            "idiom": "花前月下",
            "explain": "本指游乐休息的环境。后多指谈情说爱的处所。"
        },
        {
            "idiom": "箭在弦上",
            "explain": "箭已搭在弦上。比喻为形势所迫，不得不采取某种行动。"
        },
        {
            "idiom": "萍水相逢",
            "explain": "浮萍随水漂泊，聚散不定。比喻向来不认识的人偶然相遇。"
        },
        {
            "idiom": "门可罗雀",
            "explain": "罗：张网捕捉。大门之前可以张起网来捕麻雀。形容十分冷落，宾客稀少。"
        },
        {
            "idiom": "未雨绸缪",
            "explain": "绸缪：紧密缠缚。天还没有下雨，先把门窗绑牢。比喻事先做好准备工作。"
        },
        {
            "idiom": "蜻蜓点水",
            "explain": "指蜻蜓在水面飞行时用尾部轻触水面的动作。比喻做事肤浅不深入。"
        },
        {
            "idiom": "羊入虎口",
            "explain": "谓羊处于老虎的威胁下，或进入了老虎的领地。比喻弱者陷入险恶的境地，面临被残害的处境。"
        },
        {
            "idiom": "七手八脚",
            "explain": "形容人多手杂，动作纷乱。"
        },
        {
            "idiom": "可圈可点",
            "explain": "文章精彩，值得加以圈点，形容表现好，值得肯定或赞扬。"
        },
        {
            "idiom": "轻于鸿毛",
            "explain": "鸿毛：大雁的毛。比大雁的毛还轻。比喻毫无价值。"
        },
        {
            "idiom": "狐假虎威",
            "explain": "假：借。 狐狸假借老虎的威势。比喻依仗别人的势力欺压人。"
        },
        {
            "idiom": "嗤之以鼻",
            "explain": "嗤：讥笑。用鼻子吭声冷笑。表示轻蔑。"
        },
        {
            "idiom": "一醉方休",
            "explain": "一直到醉才肯停止。"
        },
        {
            "idiom": "重蹈覆辙",
            "explain": "蹈：踏；覆：翻；辙：车轮辗过的痕迹。重新走上翻过车的老路。比喻不吸取教训，再走失败的老路。"
        },
        {
            "idiom": "唉声叹气",
            "explain": "因伤感郁闷或悲痛而发出叹息的声音。"
        },
        {
            "idiom": "血口喷人",
            "explain": "比喻用恶毒的话污蔑或辱骂别人。"
        },
        {
            "idiom": "深不可测",
            "explain": "深得无法测量。比喻对事物的情况捉摸不透。"
        },
        {
            "idiom": "天各一方",
            "explain": "指各在天底下的一个地方。 形容相隔极远，见面困难。"
        },
        {
            "idiom": "逆水行舟",
            "explain": "逆着水流的方向行船。 比喻不努力就要后退。"
        },
        {
            "idiom": "身怀六甲",
            "explain": "六甲，传说为天帝造物之日。后因以“身怀六甲”谓妇女怀孕。"
        },
        {
            "idiom": "青黄不接",
            "explain": "青：田时的青苗；黄：成熟的谷物。旧粮已经吃完，新粮尚未接上。也比喻人才或物力前后接不上。"
        },
        {
            "idiom": "每况愈下",
            "explain": "越往下越明显。表示情况越来越坏。"
        },
        {
            "idiom": "将心比心",
            "explain": "设身处地地为别人着想。"
        },
        {
            "idiom": "只手遮天",
            "explain": "一只手把天遮住。"
        },
        {
            "idiom": "目瞪口呆",
            "explain": "形容因吃惊或害怕而发愣的样子。"
        },
        {
            "idiom": "敲锣打鼓",
            "explain": "①指欢庆祝贺。②形容大造声势，大肆进行舆论宣扬。"
        },
        {
            "idiom": "胆小如鼠",
            "explain": "胆子小得像老鼠。 形容非常胆小。"
        },
        {
            "idiom": "猴子捞月",
            "explain": "启示：这群猴子太傻了， 竟干出如此不切实际的事。然而世上也有类似的人，他们凭幻想办事，其结果能不与猴子一样吗？。"
        },
        {
            "idiom": "大显身手",
            "explain": "显：表露，表现；身手：指本领。 充分显示出本领和才能。"
        },
        {
            "idiom": "三令五申",
            "explain": "令：命令；申：表达，说明。 多次命令和告诫。"
        },
        {
            "idiom": "面红耳赤",
            "explain": "脸比耳朵都红了。形容因激动或羞惭而脸色发红。"
        },
        {
            "idiom": "覆水难收",
            "explain": "覆：倒。倒在地上的水难以收回。比喻事情已成定局，无法挽回。"
        },
        {
            "idiom": "紫气东来",
            "explain": "传说老子过函谷关之前，关尹喜见有紫气从东而来，知道将有圣人过关。 果然老子骑着青牛而来。旧时比喻吉祥的征兆。"
        },
        {
            "idiom": "鸡犬升天",
            "explain": "传说汉朝淮南王刘安修炼成仙后，把剩下的药撒在院子里，鸡和狗吃了，也都升天了。 后比喻一个人做了官，和他有关的人也跟着得势。"
        },
        {
            "idiom": "乐极生悲",
            "explain": "高兴到极点时，发生使人悲伤的事。"
        },
        {
            "idiom": "八仙过海",
            "explain": "相传八仙过海时不用舟船，各有一套法术。民间因有“八仙过海，各显神通”的谚语。后以比喻各自拿出本领或办法，互相竞赛。"
        },
        {
            "idiom": "无独有偶",
            "explain": "独：一个；偶：一双。 不只一个，竟然还有配对的。表示两事或两人十分相似。"
        },
        {
            "idiom": "一败涂地",
            "explain": "形容失败到了不可收拾的地步。"
        },
        {
            "idiom": "浪子回头",
            "explain": "浪子：二流子。 不务正业的人改邪归正。"
        },
        {
            "idiom": "衣食父母",
            "explain": "踏入社会都靠父母提供。 指生活所依赖的人。"
        },
        {
            "idiom": "点石成金",
            "explain": "比喻修改文章时稍稍改动原来的文字，就使它变得很出色。"
        },
        {
            "idiom": "项庄舞剑",
            "explain": "比喻说话和行动的真实意图别有所指。同“项庄舞剑，意在沛公”"
        },
        {
            "idiom": "声东击西",
            "explain": "声：声张。指造成要攻打东边的声势，实际上却攻打西边。是使对方产生错觉以出奇制胜的一种战术。"
        },
        {
            "idiom": "胸有成竹",
            "explain": "原指画竹子要在心里有一幅竹子的形象。 后比喻做事之前已经有通盘的考虑。"
        },
        {
            "idiom": "阴差阳错",
            "explain": "比喻由于偶然的因素而造成了差错。"
        },
        {
            "idiom": "捉襟见肘",
            "explain": "拉一拉衣襟，就露出臂肘。形容衣服破烂。比喻顾此失彼，穷于应付。"
        },
        {
            "idiom": "狗急跳墙",
            "explain": "狗急了也能跳过墙去。比喻坏人在走投无路时豁出去，不顾一切地捣乱。"
        },
        {
            "idiom": "弥天大谎",
            "explain": "弥天：满天。形容天大的谎话。"
        },
        {
            "idiom": "两面三刀",
            "explain": "比喻居心不良，当面一套，背后一套。"
        },
        {
            "idiom": "大海捞针",
            "explain": "在大海里捞一根针。 比喻极难找到。"
        },
        {
            "idiom": "鞍前马后",
            "explain": "马前马后。 指追随左右。"
        },
        {
            "idiom": "不可一世",
            "explain": "一世：一时。 认为当代的人都不行。形容目空一切、狂妄自大到了极点。"
        },
        {
            "idiom": "拔苗助长",
            "explain": "比喻违反事物发展的客观规律，急于求成，反而坏事。"
        },
        {
            "idiom": "形影不离",
            "explain": "像形体和它的影子那样分不开。形容彼此关系亲密、经常在一起。"
        },
        {
            "idiom": "行尸走肉",
            "explain": "行尸：可以走动的尸体；走肉：会走动而没有灵魂的躯壳。 比喻不动脑筋，不起作用，糊里糊涂过日子的人。"
        },
        {
            "idiom": "闭门思过",
            "explain": "过：过失。关起门来反省。"
        },
        {
            "idiom": "天涯海角",
            "explain": "形容极远的地方，或相隔极远。"
        },
        {
            "idiom": "僧多粥少",
            "explain": "和尚多，而供和尚喝的粥少。 比喻物少人多，不够分配。"
        },
        {
            "idiom": "塞翁失马",
            "explain": "塞：边界险要之处；翁：老头。比喻一时虽然受到损失，也许反而因此能得到好处。也指坏事在一定条件下可变为好事。"
        },
        {
            "idiom": "破镜重圆",
            "explain": "比喻夫妻失散或离婚后重新团聚。"
        },
        {
            "idiom": "半壁江山",
            "explain": "半壁：半边；江山：比喻国家疆土。指在敌人入侵后残存或丧失的部分国土。"
        },
        {
            "idiom": "不卑不亢",
            "explain": "卑：低、自卑；亢：高傲。指对人有恰当的分寸，既不低声下气，也不傲慢自大。"
        },
        {
            "idiom": "班门弄斧",
            "explain": "在鲁班门前舞弄斧子。 比喻在行家面前卖弄本领，不自量力。"
        },
        {
            "idiom": "一五一十",
            "explain": "五、十：计数单位。五个十个地将数目点清。比喻叙述从头到尾，源源本本，没有遗漏。也形容查点数目。"
        },
        {
            "idiom": "以卵击石",
            "explain": "拿蛋去碰石头。比喻不估计自己的力量，自取灭亡。"
        },
        {
            "idiom": "落叶知秋",
            "explain": "指见到落地的黄叶，知道已经是秋天快到了。"
        },
        {
            "idiom": "红光满面",
            "explain": "形容人的气色好，脸色红润，满面光彩"
        },
        {
            "idiom": "巧言如簧",
            "explain": "形容花言巧语，能说会道。"
        },
        {
            "idiom": "妙语如珠",
            "explain": "指诗文中警句妙语很多。 【出处】:宋·苏轼《次韵答子由》诗:“好语如珠串一一,妄心如膜退重重。”"
        },
        {
            "idiom": "负荆请罪",
            "explain": "负：背着；荆：荆条。背着荆条向对方请罪。表示向人认错赔罪。"
        },
        {
            "idiom": "弱不经风",
            "explain": "形容人身体娇弱，连风吹都经受不起。出自唐朝诗人杜甫《江雨有怀郑典设诗》"
        },
        {
            "idiom": "马失前蹄",
            "explain": "一个贬义的成语，比喻偶然发生差错而受挫。"
        },
        {
            "idiom": "南辕北辙",
            "explain": "想往南而车子却向北行。比喻行动和目的正好相反。"
        },
        {
            "idiom": "鸡毛蒜皮",
            "explain": "比喻无关紧要的琐碎事情。"
        },
        {
            "idiom": "缺衣少食",
            "explain": "衣食不足。 指贫穷。亦作“缺食无衣”。"
        },
        {
            "idiom": "明镜高悬",
            "explain": "传说秦始皇有一面镜子，能照人心胆。比喻官员判案公正廉明。"
        },
        {
            "idiom": "请君入瓮",
            "explain": "瓮：一种陶制的盛器。比喻用某人整治别人的办法来整治他自己。"
        },
        {
            "idiom": "三缄其口",
            "explain": "缄：封。 在他嘴上贴了三张封条。形容说话谨慎。现在也用来形容不肯或不敢开口。"
        },
        {
            "idiom": "鱼目混珠",
            "explain": "混：搀杂，冒充。拿鱼眼睛冒充珍珠。比喻用假的冒充真的。"
        },
        {
            "idiom": "五体投地",
            "explain": "两手、两膝和头一起着地。 是佛教一种最恭敬的行礼仪式。比喻佩服到了极点。"
        },
        {
            "idiom": "石破天惊",
            "explain": "原形容箜篌的声音，忽而高亢，忽而低沉，出人意外，有难以形容的奇境。后多比喻文章议论新奇惊人。"
        },
        {
            "idiom": "跳梁小丑",
            "explain": "跳梁：腾跃跳动；小丑：对人的卑称。比喻猖狂捣乱而成不了大气候的坏人。"
        },
        {
            "idiom": "皮开肉绽",
            "explain": "绽：裂开。皮肉都裂开了。形容伤势严重。多指受残酷拷打。"
        },
        {
            "idiom": "军令如山",
            "explain": "军事命令像山一样不可动摇。旧时形容军队中上级发布的命令，下级必须执行，不得违抗。"
        },
        {
            "idiom": "粗茶淡饭",
            "explain": "粗：粗糙、简单；淡饭：指饭菜简单。形容饮食简单，生活简朴。"
        },
        {
            "idiom": "目不识丁",
            "explain": "连最普通的“丁”字也不认识。形容一个字也不认得。"
        },
        {
            "idiom": "螳臂当车",
            "explain": "当：阻挡。螳螂举起前肢企图阻挡车子前进。比喻做力量做不到的事情，必然失败。"
        },
        {
            "idiom": "穷困潦倒",
            "explain": "穷困：贫穷、困难；潦倒：失意。生活贫困，失意颓丧。"
        },
        {
            "idiom": "嫦娥奔月",
            "explain": "嫦娥：月宫仙子；奔：投向。嫦娥投向月亮。"
        },
        {
            "idiom": "不堪入目",
            "explain": "指形象丑恶，使人看不下去。"
        },
        {
            "idiom": "手到病除",
            "explain": "刚动手治疗，病就除去了。形容医术高明。也比喻工作做得很好，解决问题迅速。"
        },
        {
            "idiom": "丢三落四",
            "explain": "形容做事马虎粗心，不是丢了这个，就是忘了那个。"
        },
        {
            "idiom": "近水楼台",
            "explain": "水边的楼台先得到月光。 比喻能优先得到利益或便利的某种地位或关系。"
        },
        {
            "idiom": "白日做梦",
            "explain": "大白天做梦。 比喻根本不能实现的梦想。"
        },
        {
            "idiom": "笑里藏刀",
            "explain": "形容对人外表和气，却阴险毒辣。"
        },
        {
            "idiom": "借酒消愁",
            "explain": "用酒来浇灭气愤或愁闷。"
        },
        {
            "idiom": "苦口婆心",
            "explain": "苦口：反复规劝；婆心：仁慈的心肠。比喻善意而又耐心地劝导。"
        },
        {
            "idiom": "柳暗花明",
            "explain": "垂柳浓密，鲜花夺目。形容柳树成荫，繁花似锦的春天景象。也比喻在困难中遇到转机。"
        },
        {
            "idiom": "斗转星移",
            "explain": "星斗变动位置。指季节或时间的变化。"
        },
        {
            "idiom": "狼狈为奸",
            "explain": "狼和狈一同出外伤害牲畜，狼用前腿，狈用后腿，既跑得快，又能爬高。比喻互相勾结干坏事。"
        },
        {
            "idiom": "两败俱伤",
            "explain": "俱：都。斗争双方都受到损伤，谁也没得到好处。"
        },
        {
            "idiom": "铁杵成针",
            "explain": "比喻只要有毅力，肯下苦功，事情就能成功。"
        },
        {
            "idiom": "愿者上钩",
            "explain": "比喻心甘情愿地上当"
        },
        {
            "idiom": "充耳不闻",
            "explain": "充：塞住。塞住耳朵不听。形容有意不听别人的意见。"
        },
        {
            "idiom": "水到渠成",
            "explain": "渠：水道。 水流到的地方自然形成一条水道。比喻条件成熟，事情自然会成功。"
        },
        {
            "idiom": "天外有天",
            "explain": "指某一境界之外更有无穷无尽的境界。 多用来表示人的眼界受客观条件的限制，认识的领域需要不断扩大。也表示美好的境界阅历不尽。亦作“山外有山”、“峰外有峰”"
        },
        {
            "idiom": "草木皆兵",
            "explain": "木：树；皆：全；都是。野草和树木都像是兵士。比喻军队败退时心虚；把草木都看成为是敌兵。亦形容极度惊恐时发出多疑的错觉。"
        },
        {
            "idiom": "引人入胜",
            "explain": "胜：胜境。 引人进入佳境。现多用来指风景或文艺作品特别吸引人。"
        },
        {
            "idiom": "掩人耳目",
            "explain": "遮掩别人的耳朵和眼睛。 比喻用假象迷惑人，欺骗人。"
        },
        {
            "idiom": "无时无刻",
            "explain": "没有时刻。常与否定词连用，指时时刻刻、随时的意思。"
        },
        {
            "idiom": "百发百中",
            "explain": "形容射箭或打枪准确，每次都命中目标。也比喻做事有充分把握。"
        },
        {
            "idiom": "兵临城下",
            "explain": "敌军已来到自己的城墙下面。比喻情势十分危急。"
        },
        {
            "idiom": "一叶障目",
            "explain": "眼睛被一片树叶挡住，指看不到事物的全貌。"
        },
        {
            "idiom": "独当一面",
            "explain": "单独负责一个方面的工作。"
        },
        {
            "idiom": "美中不足",
            "explain": "大体很好，但还有不足。"
        },
        {
            "idiom": "双管齐下",
            "explain": "管：指笔。原指手握双笔同时作画。后比喻做一件事两个方面同时进行或两种方法同时使用。"
        },
        {
            "idiom": "对牛弹琴",
            "explain": "讥笑听话的人不懂对方说得是什么。用以讥笑说话的人不看对象。"
        },
        {
            "idiom": "闻鸡起舞",
            "explain": "听到鸡叫就起来舞剑。后比喻有志报国的人及时奋起。"
        },
        {
            "idiom": "白纸黑字",
            "explain": "白纸上写下了黑字。 比喻有确凿的文字凭据，不容抵赖或悔改。"
        },
        {
            "idiom": "愚公移山",
            "explain": "比喻坚持不懈地改造自然和坚定不移地进行斗争。"
        },
        {
            "idiom": "寄人篱下",
            "explain": "寄：依附。 依附于他人篱笆下。比喻依附别人生活。"
        },
        {
            "idiom": "五音不全",
            "explain": "唱歌时，有人唱得不搭调，常常走音，。唱歌变成绝无优美旋律可言的“念歌”或“喊歌”。"
        },
        {
            "idiom": "古往今来",
            "explain": "从古到今。 泛指很长一段时间。"
        },
        {
            "idiom": "名利双收",
            "explain": "既得名声，又获利益。"
        },
        {
            "idiom": "昂首挺胸",
            "explain": "抬起头，挺起胸膛。 形容斗志高，士气旺。"
        },
        {
            "idiom": "回眸一笑",
            "explain": "眸：眼珠。转动眼珠，嫣然一笑。常用以形容女子妩媚的表情。"
        },
        {
            "idiom": "管中窥豹",
            "explain": "从竹管的小孔里看豹，只看到豹身上的一块斑纹。比喻只看到事物的一部分，指所见不全面或略有所得。"
        },
        {
            "idiom": "七上八下",
            "explain": "形容无所适从或心神不宁；指不上不下，处于中等位置；形容杂乱不整齐"
        },
        {
            "idiom": "背水一战",
            "explain": "背水：背向水，表示没有退路。 比喻与敌人决一死战。"
        },
        {
            "idiom": "水落石出",
            "explain": "水落下去，水底的石头就露出来。比喻事情的真相完全显露出来。"
        },
        {
            "idiom": "兔死狐悲",
            "explain": "兔子死了，狐狸感到悲伤。比喻因同类的死亡而感到悲伤。"
        },
        {
            "idiom": "竹篮打水",
            "explain": "比喻白费气力，劳而无功。"
        },
        {
            "idiom": "同床异梦",
            "explain": "异：不同。 原指夫妇生活在一起，但感情不和。比喻同做一件事而心里各有各的打算。"
        },
        {
            "idiom": "轰轰烈烈",
            "explain": "轰轰：象声词，形容巨大的声响；烈烈：火焰炽盛的样子。 形容事业的兴旺。也形容声势浩大，气魄宏伟。"
        },
        {
            "idiom": "人面兽心",
            "explain": "面貌虽然是人，但心肠像野兽一样凶狠。 形容为人凶残卑鄙。"
        },
        {
            "idiom": "举手投足",
            "explain": "一抬手，一动脚。形容轻而易举，毫不费力。"
        },
        {
            "idiom": "拨乱反正",
            "explain": "拨：治理；乱：指乱世；反：通“返”，回复。消除混乱局面，恢复正常秩序。"
        },
        {
            "idiom": "参差不齐",
            "explain": "参差：长短、高低不齐。形容水平不一或很不整齐。"
        },
        {
            "idiom": "凤毛麟角",
            "explain": "凤凰的羽毛，麒麟的角。 比喻珍贵而稀少的人或物。"
        },
        {
            "idiom": "气吞山河",
            "explain": "气势可以吞没山河。形容气魄很大。"
        },
        {
            "idiom": "见钱眼开",
            "explain": "看到钱财，眼睛就睁大了。形容人贪财。"
        },
        {
            "idiom": "门庭若市",
            "explain": "庭：院子；若：像；市：集市。 门前和院子里人很多，像市场一样。原形容进谏的人很多。现形容来的人很多，非常热闹。"
        },
        {
            "idiom": "唇亡齿寒",
            "explain": "嘴唇没有了，牙齿就会感到寒冷。 比喻利害密要相关。"
        },
        {
            "idiom": "短兵相接",
            "explain": "短兵：刀剑等短兵器；接：交战。指近距离搏斗。比喻面对面地进行激烈的斗争。"
        },
        {
            "idiom": "东山再起",
            "explain": "指再度出任要职。也比喻失势之后又重新得势。"
        },
        {
            "idiom": "藕断丝连",
            "explain": "藕已折断，但还有许多丝连接着未断开。比喻没有彻底断绝关系。多指男女之间情思难断。"
        },
        {
            "idiom": "百里挑一",
            "explain": "一百个当中就挑出这一个来。形容人才出众。"
        },
        {
            "idiom": "颠三倒四",
            "explain": "三、四：表示杂乱。 形容说话做事错杂紊乱。"
        },
        {
            "idiom": "放虎归山",
            "explain": "把老虎放回山去。比喻把坏人放回老巢，留下祸根。"
        },
        {
            "idiom": "抱薪救火",
            "explain": "薪：柴草。抱着柴草去救火。比喻用错误的方法去消除灾祸，结果使灾祸反而扩大。"
        },
        {
            "idiom": "蠢蠢欲动",
            "explain": "蠢蠢：爬虫蠕动的样子。 比喻敌人准备进攻或坏人阴谋捣乱。"
        },
        {
            "idiom": "据理力争",
            "explain": "依据道理，竭力维护自己方面的权益、观点等。"
        },
        {
            "idiom": "画龙点睛",
            "explain": "原形容梁代画家张僧繇作画的神妙。后多比喻写文章或讲话时，在关键处用几句话点明实质，使内容生动有力。"
        },
        {
            "idiom": "抱头鼠窜",
            "explain": "抱着头，像老鼠那样惊慌逃跑。 形容受到打击后狼狈逃跑。"
        },
        {
            "idiom": "金屋藏娇",
            "explain": "娇：原指汉武帝刘彻的表妹陈阿娇。 汉武帝幼小时喜爱阿娇，并说要让她住在金屋里。指以华丽的房屋让所爱的妻妾居住。也指取妾。"
        },
        {
            "idiom": "鸟语花香",
            "explain": "鸟叫得好听，花开得喷香。形容春天的美好景象。"
        },
        {
            "idiom": "肝肠寸断",
            "explain": "肝肠一寸寸断开。比喻伤心到极点。"
        },
        {
            "idiom": "模棱两可",
            "explain": "模棱：含糊，不明确；两可：可以这样，也可以那样。 指不表示明确的态度，或没有明确的主张。"
        },
        {
            "idiom": "马到成功",
            "explain": "形容工作刚开始就取得成功。"
        },
        {
            "idiom": "牛头马面",
            "explain": "迷信传说中的两个鬼卒，一个头像牛，一个头像马。比喻各种丑恶的人。"
        },
        {
            "idiom": "呆若木鸡",
            "explain": "呆：傻，发愣的样子。呆得像木头鸡一样。形容因恐惧或惊异而发愣的样子。"
        },
        {
            "idiom": "话中有话",
            "explain": "话里含有别的意思。"
        },
        {
            "idiom": "长吁短叹",
            "explain": "吁：叹息。长一声、短一声不住地叹气。形容发愁的神情。"
        },
        {
            "idiom": "才高八斗",
            "explain": "才：才华。 比喻人极有才华。"
        },
        {
            "idiom": "掩耳盗铃",
            "explain": "掩：遮蔽，遮盖；盗：偷。偷铃铛怕别人听见而捂住自己的耳朵。比喻自己欺骗自己，明明掩盖不住的事情偏要想法子掩盖。"
        },
        {
            "idiom": "新仇旧恨",
            "explain": "新仇加旧恨。形容仇恨深。"
        },
        {
            "idiom": "满载而归",
            "explain": "载：装载；归：回来。 装得满满地回来。形容收获很大。"
        },
        {
            "idiom": "官官相护",
            "explain": "指官员之间互相包庇。"
        },
        {
            "idiom": "五光十色",
            "explain": "形容色彩鲜艳，花样繁多。"
        },
        {
            "idiom": "鹤立鸡群",
            "explain": "像鹤站在鸡群中一样。 比喻一个人的仪表或才能在周围一群人里显得很突出。"
        },
        {
            "idiom": "剑拔弩张",
            "explain": "张：弓上弦。剑拔出来了，弓张开了。原形容书法笔力遒劲。后多形容气势逼人，或形势紧张，一触即发。"
        },
        {
            "idiom": "普天同庆",
            "explain": "天下的人或全国的人共同庆祝。"
        },
        {
            "idiom": "多此一举",
            "explain": "举：行动。指多余的，没有必要的举动。"
        },
        {
            "idiom": "金鸡独立",
            "explain": "指独腿站立的一种武术姿势。后也指用一足站立。"
        },
        {
            "idiom": "岁寒三友",
            "explain": "松、竹经冬不凋，梅花耐寒开放，因此有“岁寒三友”之称。"
        },
        {
            "idiom": "一刀两断",
            "explain": "一刀斩为两段。比喻坚决断绝关系。"
        },
        {
            "idiom": "盲人摸象",
            "explain": "比喻对事物只凭片面的了解或局部的经验，就乱加猜测，想做出全面的判断。"
        },
        {
            "idiom": "杀鸡儆猴",
            "explain": "杀鸡给猴子看。 比喻用惩罚一个人的办法来警告别的人。"
        },
        {
            "idiom": "门当户对",
            "explain": "旧时指男女双方的社会地位和经济情况相当，结亲很适合。"
        },
        {
            "idiom": "是非不分",
            "explain": "分辨不出正确与错误"
        },
        {
            "idiom": "一帆风顺",
            "explain": "船挂着满帆顺风行驶。比喻非常顺利，没有任何阻碍。"
        },
        {
            "idiom": "渐入佳境",
            "explain": "佳：好；境：境地。原指甘蔗下端比上端甜，从上到下，越吃越甜。后比喻境况逐渐好转或兴趣逐渐浓厚。"
        },
        {
            "idiom": "七窍生烟",
            "explain": "七窍：口和两眼、两耳、两鼻孔。 气愤得好像耳目口鼻都要冒出火来。形容气愤到极点。"
        },
        {
            "idiom": "丑态百出",
            "explain": "各种丑恶的样子都表现出来了。"
        },
        {
            "idiom": "悬崖勒马",
            "explain": "悬崖：高而陡的山崖；勒马：收住缰绳，使马停步。在高高的山崖边上勒住马。比喻到了危险的边缘及时清醒回头。"
        },
        {
            "idiom": "车水马龙",
            "explain": "车像流水，马像游龙。形容来往车马很多，连续不断的热闹情景。"
        },
        {
            "idiom": "妙手回春",
            "explain": "回春：使春天重返，比喻将快死的人救活。 指医生医术高明。"
        },
        {
            "idiom": "万念俱灰",
            "explain": "所有的想法和打算都破灭了。形容极端灰心失望的心情。"
        },
        {
            "idiom": "打草惊蛇",
            "explain": "打草惊了草里的蛇。 原比喻惩罚了甲而使乙有所警觉。后多比喻做法不谨慎，反使对方有所戒备。"
        },
        {
            "idiom": "一见倾心",
            "explain": "倾心：爱慕。初次见面就十分爱幕。"
        },
        {
            "idiom": "走马观花",
            "explain": "走马：骑着马跑。 骑在奔跑的马上看花。原形容事情如意，心境愉快。后多指大略地观察一下。"
        },
        {
            "idiom": "偷鸡摸狗",
            "explain": "指偷窃的行为。也指不正经的勾当。"
        },
        {
            "idiom": "恩重如山",
            "explain": "恩情深厚，像山一样深重。"
        },
        {
            "idiom": "愁眉苦脸",
            "explain": "皱着眉头，哭丧着脸。 形容愁苦的神色。"
        },
        {
            "idiom": "一目十行",
            "explain": "看书时同时可以看十行。 形容看书非常快。"
        },
        {
            "idiom": "投石问路",
            "explain": "原指夜间潜入某处前，先投以石子，看看有无反应，借以探测情况。后用以比喻进行试探。"
        },
        {
            "idiom": "面黄肌瘦",
            "explain": "脸色发黄，身体瘦削。 形容人营养不良或有病的样子。"
        },
        {
            "idiom": "有权有势",
            "explain": "势：地位和权力。 既有权力，又有地位。"
        },
        {
            "idiom": "异曲同工",
            "explain": "工：细致，巧妙；异：不同的。不同的曲调演得同样好。比喻话的说法不一而用意相同，或一件事情的做法不同而都巧妙地达到目的。"
        },
        {
            "idiom": "东张西望",
            "explain": "张：看。形容这里那里地到处看。"
        },
        {
            "idiom": "今非昔比",
            "explain": "昔：过去。现在不是过去能比得上的。多指形势、自然面貌等发生了巨大的变化。"
        },
        {
            "idiom": "口说无凭",
            "explain": "单凭口说，不足为据。"
        },
        {
            "idiom": "眉飞色舞",
            "explain": "色：脸色。形容人得意兴奋的样子。"
        },
        {
            "idiom": "顶天立地",
            "explain": "头顶云天，脚踏大地。 形容形象高大，气慨豪迈。"
        },
        {
            "idiom": "三长两短",
            "explain": "指意外的灾祸或事故。特指人的死亡。"
        },
        {
            "idiom": "口是心非",
            "explain": "嘴里说得很好，心里想的却是另一套。指心口不一致。"
        },
        {
            "idiom": "斗折蛇行",
            "explain": "斗折：像北斗星的排列一样曲折。像北斗星一样弯曲，像蛇一样曲折行进。形容道路曲折蜿蜒。"
        },
        {
            "idiom": "卧薪尝胆",
            "explain": "薪：柴草。睡觉睡在柴草上，吃饭睡觉都尝一尝苦胆。形容人刻苦自励，发奋图强。"
        },
        {
            "idiom": "出生入死",
            "explain": "原意是从出生到死去。 后形容冒着生命危险，不顾个人安危。"
        },
        {
            "idiom": "逆来顺受",
            "explain": "指对恶劣的环境或无礼的待遇采取顺从和忍受的态度。"
        },
        {
            "idiom": "夜深人静",
            "explain": "深夜没有人声，非常寂静。"
        },
        {
            "idiom": "白面书生",
            "explain": "指缺乏阅历经验的读书人。也指面孔白净的读书人。"
        },
        {
            "idiom": "一路顺风",
            "explain": "旅途平安（多用于祝人）。"
        },
        {
            "idiom": "远走高飞",
            "explain": "指象野兽远远跑掉，象鸟儿远远飞走。 比喻人跑到很远的地方去。多指摆脱困境去寻找出路。"
        },
        {
            "idiom": "狡兔三窟",
            "explain": "窟：洞穴。狡猾的兔子准备好几个藏身的窝。比喻隐蔽的地方或方法多。"
        },
        {
            "idiom": "明争暗斗",
            "explain": "明里暗里都在进行争斗。 形容各用心思，互相排挤。"
        },
        {
            "idiom": "遁入空门",
            "explain": "遁：逃遁；空门：指佛教，因佛教认为世界是一切皆空的。指出家。避开尘世而入佛门。"
        },
        {
            "idiom": "旗开得胜",
            "explain": "刚一打开旗帜进入战斗，就取得了胜利。比喻事情刚一开始，就取得好成绩。"
        },
        {
            "idiom": "滥竽充数",
            "explain": "滥：失实的，假的。不会吹竽的人混在吹竽的队伍里充数。比喻无本领的冒充有本领，次货冒充好货。"
        },
        {
            "idiom": "卖国求荣",
            "explain": "勾结投靠敌人，出卖国家的权益，谋求个人的富贵。"
        },
        {
            "idiom": "貌合神离",
            "explain": "貌：外表；神：内心。 表面上关系很密切，实际上是两条心。"
        },
        {
            "idiom": "心花怒放",
            "explain": "怒放：盛开。心里高兴得像花儿盛开一样。形容极其高兴。"
        },
        {
            "idiom": "外强中干",
            "explain": "干：枯竭。形容外表强壮，内里空虚。"
        },
        {
            "idiom": "残羹冷炙",
            "explain": "指吃剩的饭菜。也比喻别人施舍的东西。"
        },
        {
            "idiom": "画地为牢",
            "explain": "在地上画一个圈当做监狱。比喻只许在指定的范围内活动。"
        },
        {
            "idiom": "比翼双飞",
            "explain": "比翼：翅膀挨着翅膀。双飞：成双的并飞。比喻夫妻情投意合，在事业上并肩前进。"
        },
        {
            "idiom": "照猫画虎",
            "explain": "比喻照着样子模仿。"
        },
        {
            "idiom": "抛砖引玉",
            "explain": "抛出砖去，引回玉来。比喻用自己不成熟的意见或作品引出别人更好的意见或好作品。"
        },
        {
            "idiom": "绕梁三日",
            "explain": "形容音乐高昂激荡，虽过了很长时间，好像仍在回响。"
        },
        {
            "idiom": "盲人瞎马",
            "explain": "盲人骑着瞎马。比喻盲目行动，后果十分危险。"
        },
        {
            "idiom": "石沉大海",
            "explain": "石头沉到海底。比喻从此没有消息。"
        },
        {
            "idiom": "单枪匹马",
            "explain": "原指打仗时一个人上阵。比喻行动没人帮助。"
        },
        {
            "idiom": "前赴后继",
            "explain": "前面的冲上去了，后面的紧跟上来。 形容不断投入战斗，奋勇冲杀向前。"
        },
        {
            "idiom": "才子佳人",
            "explain": "泛指有才貌的男女。"
        },
        {
            "idiom": "青梅竹马",
            "explain": "青梅：青的梅子；竹马：儿童以竹竿当马骑。形容小儿女天真无邪玩耍游戏的样子。现指男女幼年时亲密无间。"
        },
        {
            "idiom": "井底之蛙",
            "explain": "井底的蛙只能看到井口那么大的一块天。比喻见识狭窄的人。"
        },
        {
            "idiom": "力挽狂澜",
            "explain": "挽：挽回；狂澜：猛烈的大波浪。比喻尽力挽回危险的局势。"
        },
        {
            "idiom": "仁者无敌",
            "explain": "施行仁政的君王，必然赢得民众的拥戴；上下一心，众志成城，是无敌于天下的。"
        },
        {
            "idiom": "树大招风",
            "explain": "比喻人出了名或有了钱财就容易惹人注意，引起麻烦。"
        },
        {
            "idiom": "从头至尾",
            "explain": "从开头至结尾。指某件事物的全过程或全部内容。"
        },
        {
            "idiom": "一马当先",
            "explain": "原指作战时策马冲锋在前。形容领先。也比喻工作走在群众前面，积极带头。"
        },
        {
            "idiom": "拈花惹草",
            "explain": "拈：捏；惹：招惹；草、花：比喻女子。比喻到处留情，多指男女间的挑逗引诱。"
        },
        {
            "idiom": "满腹经纶",
            "explain": "经纶：整理丝缕，引伸为人的才学、本领。形容人极有才干和智谋。"
        },
        {
            "idiom": "四通八达",
            "explain": "四面八方都有路可通。形容交通极便利。也形容通向各方。"
        },
        {
            "idiom": "废寝忘食",
            "explain": "废：停止。 顾不得睡觉，忘记了吃饭。形容专心努力。"
        },
        {
            "idiom": "青面獠牙",
            "explain": "青面：脸上泛着青色；獠牙：露在外面的长牙。旧时神怪故事中形容凶神恶鬼的面貌。现形容人面貌极其凶恶。"
        },
        {
            "idiom": "春色满园",
            "explain": "园内到处都是春天美丽的景色。 比喻欣欣向荣的景象。"
        },
        {
            "idiom": "虎口拔牙",
            "explain": "从老虎嘴里拔牙。比喻做十分危险的事情。"
        },
        {
            "idiom": "左右开弓",
            "explain": "左右手都能射箭。比喻两只手轮流做同一动作或同时做几项工作。"
        },
        {
            "idiom": "指手画脚",
            "explain": "指说话时做出各种动作。形容说话时放肆或得意忘形。"
        },
        {
            "idiom": "四大皆空",
            "explain": "四大：古印度称地、水、火风为“四大”。 佛教用语。指世界上一切都是空虚的。是一种消极思想。"
        },
        {
            "idiom": "背井离乡",
            "explain": "背：离开；井：古制八家为井，引伸为乡里，家宅。离开家乡到外地。"
        },
        {
            "idiom": "杯水车薪",
            "explain": "用一杯水去救一车着了火的柴草。比喻力量太小，解决不了问题。"
        },
        {
            "idiom": "妙笔生花",
            "explain": "比喻杰出的写作才能。"
        },
        {
            "idiom": "大步流星",
            "explain": "形容步子跨得大，走得快。"
        },
        {
            "idiom": "九牛二虎",
            "explain": "比喻很大的力气。"
        },
        {
            "idiom": "步步为营",
            "explain": "步：古时以五尺为一步，“步步”表示距离短。 军队每向前推进一步就设下一首营垒。形容防守严密，行动谨慎。"
        },
        {
            "idiom": "积少成多",
            "explain": "积累少量的东西，能成为巨大的数量。"
        },
        {
            "idiom": "山高水长",
            "explain": "像山一样高耸，如水一般长流。 原比喻人的风范或声誉像高山一样永远存在。后比喻恩德深厚。"
        },
        {
            "idiom": "一针见血",
            "explain": "比喻说话直截了当，切中要害。"
        },
        {
            "idiom": "虎头蛇尾",
            "explain": "头大如虎，尾细如蛇。 比喻开始时声势很大，到后来劲头很小，有始无终。"
        },
        {
            "idiom": "生死存亡",
            "explain": "生存或者死亡。 形容局势或斗争的的发展已到最后关头。"
        },
        {
            "idiom": "画蛇添足",
            "explain": "画蛇时给蛇添上脚。比喻做了多余的事，非但无益，反而不合适。也比喻虚构事实，无中生有。"
        },
        {
            "idiom": "居高临下",
            "explain": "居：站在，处于；临：面对。占据高处，俯视下面。形容占据的地势非常有利。"
        },
        {
            "idiom": "百川归海",
            "explain": "川：江河。 许多江河流入大海。比喻大势所趋或众望所归。也比喻许多分散的事物汇集到一个地方。"
        },
        {
            "idiom": "四脚朝天",
            "explain": "四脚：指四肢。形容仰面跌倒。也形容人死去。"
        },
        {
            "idiom": "正中下怀",
            "explain": "正合自己的心意。"
        },
        {
            "idiom": "人仰马翻",
            "explain": "人马被打得仰翻在地。 形容被打得惨败。也比喻乱得一塌糊涂，不可收拾。"
        },
        {
            "idiom": "面如死灰",
            "explain": "死灰：冷却的灰烬。形容因心情沮丧或受惊吓而脸色灰白。"
        },
        {
            "idiom": "头头是道",
            "explain": "本为佛家语，指道无所不在。后多形容说话做事很有条理。"
        },
        {
            "idiom": "人走茶凉",
            "explain": "比喻世态炎凉，人情淡漠"
        },
        {
            "idiom": "心照不宣",
            "explain": "照：知道；宣：公开说出。彼此心里明白，而不公开说出来。"
        },
        {
            "idiom": "余音绕梁",
            "explain": "形容歌声优美，给人留下难忘的印象。"
        },
        {
            "idiom": "喜上眉梢",
            "explain": "喜悦的心情从眉眼上表现出来。"
        },
        {
            "idiom": "岁岁平安",
            "explain": "每一年都能平平安安。"
        },
        {
            "idiom": "男女老少",
            "explain": "泛指所有的人。"
        },
        {
            "idiom": "得心应手",
            "explain": "得：得到，想到；应：反应，配合。心里怎么想，手就能怎么做。比喻技艺纯熟或做事情非常顺利。"
        },
        {
            "idiom": "呼之欲出",
            "explain": "呼：叫，喊。 形容人像画得逼真，似乎叫一声就会从画中走出来。泛指文学作品中人物的描写十分生动。"
        },
        {
            "idiom": "默默无闻",
            "explain": "无声无息，没人知道。 指没有什么名声。"
        },
        {
            "idiom": "针锋相对",
            "explain": "针锋：针尖。针尖对针尖。比喻双方在策略、论点及行动方式等方面尖锐对立。"
        },
        {
            "idiom": "泪流满面",
            "explain": "眼泪流了一脸。形容极度悲伤。"
        },
        {
            "idiom": "怒火中烧",
            "explain": "中；心中。怒火在心中燃烧。形容心中怀着极大的愤怒。"
        },
        {
            "idiom": "风和日丽",
            "explain": "和风习习，阳光灿烂。形容晴朗暖和的天气。"
        },
        {
            "idiom": "雕虫小技",
            "explain": "雕：雕刻；虫：指鸟虫书，古代汉字的一种字体。 比喻小技或微不足道的技能。"
        },
        {
            "idiom": "惨无人道",
            "explain": "惨：狠毒，残暴。残酷狠毒到极点，如野兽一样。"
        },
        {
            "idiom": "挖空心思",
            "explain": "比喻想尽一切办法。"
        },
        {
            "idiom": "扪心自问",
            "explain": "摸着胸口，自己问自己怎么样。 指自己反省。"
        },
        {
            "idiom": "旁若无人",
            "explain": "身旁好像没有人。形容态度傲慢，不把别人放在眼里。"
        },
        {
            "idiom": "龙吟虎啸",
            "explain": "像龙在鸣，虎在啸。比喻相关的事物互相感应。也形容人发迹。"
        },
        {
            "idiom": "物以类聚",
            "explain": "同类的东西聚在一起。 指坏人彼此臭味相投，勾结在一起。"
        },
        {
            "idiom": "酸甜苦辣",
            "explain": "指各种味道。比喻幸福、痛苦等各种境遇。"
        },
        {
            "idiom": "绝处逢生",
            "explain": "绝处：死路。形容在最危险的时候得到生路。"
        },
        {
            "idiom": "周而复始",
            "explain": "周：环绕一圈；复：又，再。 转了一圈又一圈，不断循环。"
        },
        {
            "idiom": "解甲归田",
            "explain": "解：脱下；甲：古代将士打仗时穿的战服。 脱下军装，回家种地。指战士退伍还乡。"
        },
        {
            "idiom": "千变万化",
            "explain": "形容变化极多。"
        },
        {
            "idiom": "舍己为人",
            "explain": "舍弃自己的利益去帮助别人。"
        },
        {
            "idiom": "转危为安",
            "explain": "由危险转为平安（多指局势或病情）。"
        },
        {
            "idiom": "晕头转向",
            "explain": "晕：头发昏；转向：辨不清方向。 头脑发晕，辨不清方向。形容糊里糊涂或惊惶失措。"
        },
        {
            "idiom": "木已成舟",
            "explain": "树木已经做成了船。比喻事情已成定局，无法改变。"
        },
        {
            "idiom": "文武双全",
            "explain": "文：文才；武：武艺。能文能武，文才和武艺都很出众。"
        },
        {
            "idiom": "胜友如云",
            "explain": "胜友：良友。 许多良友聚集一处。"
        },
        {
            "idiom": "唇齿相依",
            "explain": "像嘴唇和牙齿那样互相依靠。比喻关系密切，相互依靠。"
        },
        {
            "idiom": "有的放矢",
            "explain": "的：箭靶子；矢：箭。 放箭要对准靶子。比喻说话做事有针对性。"
        },
        {
            "idiom": "狗仗人势",
            "explain": "仗：倚仗、仗势。比喻坏人依靠某种势力欺侮人。"
        },
        {
            "idiom": "等闲视之",
            "explain": "等闲：寻常，一般。 把它看成平常的事，不予重视。"
        },
        {
            "idiom": "臭味相投",
            "explain": "指有坏思想、坏作风的人彼此迎合，互相结合在一起。形容人的思想兴趣相同，彼此很投合。"
        },
        {
            "idiom": "无微不至",
            "explain": "微：微细；至：到。没有一处细微的地方不照顾到。形容关怀、照顾得非常细心周到。"
        },
        {
            "idiom": "自食其果",
            "explain": "指自己做了坏事，自己受到损害或惩罚。"
        },
        {
            "idiom": "后生可畏",
            "explain": "后生：年轻人，后辈；畏：敬畏。 年轻人是可敬畏的。形容青年人能超过前辈。"
        },
        {
            "idiom": "欺上瞒下",
            "explain": "对上欺骗，博取信任；对下隐瞒，掩盖真相。"
        },
        {
            "idiom": "一衣带水",
            "explain": "一条衣带那样狭窄的水。指虽有江河湖海相隔，但距离不远，不足以成为交往的阻碍。"
        },
        {
            "idiom": "眼高手低",
            "explain": "眼力过高，手法过低。 指要求的标准很高（甚至不切实际），但实际上自己也做不到。"
        },
        {
            "idiom": "日复一日",
            "explain": "复：再，又。过了一天又一天。比喻日子久，时间长。也形容光阴白白地过去。"
        },
        {
            "idiom": "推三阻四",
            "explain": "找各种借口推托。"
        },
        {
            "idiom": "不可造次",
            "explain": "造次：急遽，匆忙。不能匆匆忙忙地进行。意为要慎重。"
        },
        {
            "idiom": "小菜一碟",
            "explain": "指不值得大肆宣扬。形容事情很容易办成。"
        },
        {
            "idiom": "其貌不扬",
            "explain": "不扬：不好看。形容人容貌难看。"
        },
        {
            "idiom": "无法无天",
            "explain": "旧指不顾国法和天理，任意干坏事。现多形容违法乱纪，不受管束。"
        },
        {
            "idiom": "一言不发",
            "explain": "一句话也不说。"
        },
        {
            "idiom": "童叟无欺",
            "explain": "童：未成年的孩子；叟：年老的男人；欺：蒙骗。 既不欺骗小孩也不欺骗老人。指买卖公平。"
        },
        {
            "idiom": "早出晚归",
            "explain": "早晨出动，晚上归来。"
        },
        {
            "idiom": "一本正经",
            "explain": "原指一部合乎道德规范的经典。后用以形容态度庄重严肃，郑重其事。有时含讽刺意味。"
        },
        {
            "idiom": "善男信女",
            "explain": "佛教用语。原指皈依佛法的男女。后泛指信仰佛教的男男女女。"
        },
        {
            "idiom": "自始至终",
            "explain": "从开始到末了。 表示一贯到底。"
        },
        {
            "idiom": "粉白黛绿",
            "explain": "泛指女子的妆饰。"
        },
        {
            "idiom": "胆大心细",
            "explain": "形容办事果断，考虑周密。"
        },
        {
            "idiom": "面目全非",
            "explain": "非：不相似。 样子完全不同了。形容改变得不成样子。"
        },
        {
            "idiom": "小惩大诫",
            "explain": "惩：惩罚；诫：警告，劝告。有小过失就惩戒，使受到教训而不致犯大错误。"
        },
        {
            "idiom": "马放南山",
            "explain": "比喻天下太平，不再用兵。 现形容思想麻痹。"
        },
        {
            "idiom": "大材小用",
            "explain": "把大的材料当成小的材料用。比喻使用不当，浪费人才。"
        },
        {
            "idiom": "如虎添翼",
            "explain": "好像老虎长上了翅膀。比喻强有力的人得到帮助变得更加强有力。"
        },
        {
            "idiom": "满城风雨",
            "explain": "城里到处刮风下雨。原形容重阳节前的雨景。后比喻某一事件传播很广，到处议论纷纷。"
        },
        {
            "idiom": "名震一时",
            "explain": "名声震动当时社会。"
        },
        {
            "idiom": "朝三暮四",
            "explain": "原指玩弄手法欺骗人。后用来比喻常常变卦，反复无常。"
        },
        {
            "idiom": "天下无双",
            "explain": "天下找不出第二个。 形容出类拔萃，独一无二。"
        },
        {
            "idiom": "因小失大",
            "explain": "为了小的利益，造成大的损失。"
        },
        {
            "idiom": "平分秋色",
            "explain": "比喻双方各得一半，不分上下。"
        },
        {
            "idiom": "屈打成招",
            "explain": "屈：冤枉；招：招供。 指无罪的人冤枉受刑，被迫招认有罪。"
        },
        {
            "idiom": "拖泥带水",
            "explain": "比喻说话做事不干脆利落。"
        },
        {
            "idiom": "小题大做",
            "explain": "指拿小题目作大文章。 比喻不恰当地把小事当作大事来处理，有故意夸张的意思。"
        },
        {
            "idiom": "三五成群",
            "explain": "几个人、几个人在一起。"
        },
        {
            "idiom": "天下为公",
            "explain": "原意是天下是公众的，天子之位，传贤而不传子，后成为一种美好社会的政治理想。"
        },
        {
            "idiom": "旁门左道",
            "explain": "原指不正派的宗教派别。借指不正派的学术派别。现泛指不正派的东西。"
        },
        {
            "idiom": "心头大患",
            "explain": "指严重隐患或要害部门的大患"
        },
        {
            "idiom": "半推半就",
            "explain": "推：抵拒，推托；就：靠拢，迎上去。一面推辞，一面靠拢上去。形容装腔作势假意推辞的样子。"
        },
        {
            "idiom": "一心两用",
            "explain": "把注意力同时集中在两件事上。 指思想不专一。"
        },
        {
            "idiom": "接二连三",
            "explain": "一个接着一个，接连不断。"
        },
        {
            "idiom": "至高无上",
            "explain": "至：最。高到顶点，再也没有更高的了。"
        },
        {
            "idiom": "锦上添花",
            "explain": "锦：有彩色花纹的丝织品。在锦上再绣花。比喻好上加好，美上添美。"
        },
        {
            "idiom": "半斤八两",
            "explain": "八两：即半斤。一个半斤，一个八两。比喻彼此一样，不相上下。"
        },
        {
            "idiom": "有口无心",
            "explain": "嘴上说了，心里可没那样想。指不是有心说的。"
        },
        {
            "idiom": "一干二净",
            "explain": "形容十分彻底，一点儿也不剩。"
        },
        {
            "idiom": "九牛一毛",
            "explain": "九条牛身上的一根毛。比喻极大数量中极微小的数量，微不足道。"
        },
        {
            "idiom": "吃里扒外",
            "explain": "接受这一方面的好处，却为那一方面卖力。也指将自己方面的情况告诉对方。"
        },
        {
            "idiom": "隔岸观火",
            "explain": "隔着河看人家着火。 比喻对别人的危难不去求助，在一旁看热闹。"
        },
        {
            "idiom": "一波三折",
            "explain": "原指写字的笔法曲折多变。现比喻文章的结构起伏曲折。也比喻事情进行中意外的变化很多。"
        },
        {
            "idiom": "开门见山",
            "explain": "打开门就能看见山。 比喻说话或写文章直截了当谈本题，不拐弯抹角。"
        },
        {
            "idiom": "大同小异",
            "explain": "大体相同，略有差异。"
        },
        {
            "idiom": "节节高升",
            "explain": "步步高升的意思"
        },
        {
            "idiom": "垂涎三尺",
            "explain": "涎：口水。 口水挂下三尺长。形容极其贪婪的样子。也形容非常眼热。"
        },
        {
            "idiom": "想入非非",
            "explain": "非非：原为佛家语，表示虚幻的境界。想到非常玄妙虚幻的地方去了。形容完全脱离现实地胡思乱想。"
        },
        {
            "idiom": "群龙无首",
            "explain": "一群龙没有领头的。 比喻没有领头的，无法统一行动。"
        },
        {
            "idiom": "云开见日",
            "explain": "拔开云雾，见到太阳。 比喻黑暗已经过去，光明已经到来。也比喻误会消除。"
        },
        {
            "idiom": "天衣无缝",
            "explain": "神话传说，仙女的衣服没有衣缝。比喻事物周密完善，找不出什么毛病。"
        },
        {
            "idiom": "两全其美",
            "explain": "美：美好。指做一件事顾全到双方，使两方面都得到好处。"
        },
        {
            "idiom": "病从口入",
            "explain": "疾病多是由食物传染。比喻应该注意饮食卫生。"
        },
        {
            "idiom": "蒸蒸日上",
            "explain": "蒸蒸：一升、兴盛的样子。形容事业一天天向上发展。"
        },
        {
            "idiom": "内圆外方",
            "explain": "指为人处事之道,表面随和,内心严正"
        },
        {
            "idiom": "举一反三",
            "explain": "反：类推。比喻从一件事情类推而知道其他许多事情。"
        },
        {
            "idiom": "长话短说",
            "explain": "要说的话很多，一时不能说清，只用扼要的几句话表明主要意思。"
        },
        {
            "idiom": "十拿九稳",
            "explain": "比喻很有把握。"
        },
        {
            "idiom": "如雷贯耳",
            "explain": "贯：贯穿，进入。响亮得像雷声传进耳朵里。形容人的名声大。"
        },
        {
            "idiom": "日上三竿",
            "explain": "太阳升起有三根竹竿那样高。形容太阳升得很高，时间不早了。也形容人起床太晚。"
        },
        {
            "idiom": "心中有数",
            "explain": "对情况和问题有基本的了解，处理事情有一定把握。"
        },
        {
            "idiom": "一拍即合",
            "explain": "拍：乐曲的段落，也称打拍子。一打拍子就合于乐曲的节奏。比喻困情意相投或有利害关系，一下子就说到一起或结合在一起。"
        },
        {
            "idiom": "小鸟依人",
            "explain": "依：依恋。像小鸟那样依傍着人。形容少女或小孩娇小可爱的样子。"
        },
        {
            "idiom": "行之有效",
            "explain": "之：代词，它，指办法、措施等；效：成效，效果。实行起来有成效。指某种方法或措施已经实行过，证明很有效用。"
        },
        {
            "idiom": "一手遮天",
            "explain": "一只手把天遮住。 形容依仗权势，玩弄手段，蒙蔽群众。"
        },
        {
            "idiom": "一刀两段",
            "explain": "一刀斩为两段。比喻坚决断绝关系。"
        },
        {
            "idiom": "火上浇油",
            "explain": "往火上倒油。 比喻使人更加愤怒或使情况更加严重。"
        },
        {
            "idiom": "入木三分",
            "explain": "相传王羲之在木板上写字，木工刻时，发现字迹透入木板三分深。 形容书法极有笔力。现多比喻分析问题很深刻。"
        },
        {
            "idiom": "三言两语",
            "explain": "几句话。形容话很少。"
        },
        {
            "idiom": "点到为止",
            "explain": "1、说话时只是轻轻触及话题的边缘，而不必深入谈论，但是已经让对方明了意图即可。（是比较含蓄的“示意”）。2、行动行为上做出小动作，让所示意的对象明白你的意图，或者是对象接下来的行为的指南。"
        },
        {
            "idiom": "扬眉吐气",
            "explain": "扬起眉头，吐出怨气。形容摆脱了长期受压状态后高兴痛快的样子。"
        },
        {
            "idiom": "能屈能伸",
            "explain": "能弯曲也能伸直。指人在失意时能忍耐，在得志时能大干一番。"
        },
        {
            "idiom": "俯首称臣",
            "explain": "低头向对方自称臣子。泛指向对方屈服。"
        },
        {
            "idiom": "德高望重",
            "explain": "德：品德；望：声望。道德高尚，名望很大。"
        },
        {
            "idiom": "天方夜谭",
            "explain": "比喻虚诞、离奇的议论。"
        },
        {
            "idiom": "本末倒置",
            "explain": "本：树根；末：树梢；置：放。比喻把主次、轻重的位置弄颠倒了。"
        },
        {
            "idiom": "里应外合",
            "explain": "应：接应；合：配合。 外面攻打，里面接应。"
        },
        {
            "idiom": "啼笑皆非",
            "explain": "啼：哭；皆非：都不是。 哭也不是，笑也不是，不知如何才好。形容处境尴尬或既令人难受又令人发笑的行为。"
        },
        {
            "idiom": "心直口快",
            "explain": "性情直爽，有话就说。"
        },
        {
            "idiom": "自圆其说",
            "explain": "圆：圆满，周全。 指说话的人能使自己的论点或谎话没有漏洞。"
        },
        {
            "idiom": "风风雨雨",
            "explain": "不断地刮风下雨。 比喻障碍重重。又比喻时代动荡，谣言纷传。"
        },
        {
            "idiom": "虎背熊腰",
            "explain": "背宽厚如虎，腰粗壮如熊。形容人身体魁梧健壮。"
        },
        {
            "idiom": "高山流水",
            "explain": "比喻知己或知音。也比喻乐曲高妙。"
        },
        {
            "idiom": "一毛不拔",
            "explain": "一根汗毛也不肯拔。 原指杨朱的极端为我主义。后形容为人非常吝啬自私。"
        },
        {
            "idiom": "四分五裂",
            "explain": "形容不完整，不集中，不团结，不统一。"
        },
        {
            "idiom": "一步登天",
            "explain": "登：上。一步跨上青天。比喻一下子就达到很高的境界或程度。有时也用来比喻人突然得志，爬上高位。"
        },
        {
            "idiom": "鸡鸣狗盗",
            "explain": "鸣：叫；盗：偷东西。 指微不足道的本领。也指偷偷摸摸的行为。"
        },
        {
            "idiom": "猪朋狗友",
            "explain": "比喻好吃懒做、不务正业的坏朋友。"
        },
        {
            "idiom": "外方内圆",
            "explain": "外方：外表有棱角，刚直；内圆：内心无棱角，圆滑。 指人的外表正直，而内心圆滑。"
        },
        {
            "idiom": "水滴石穿",
            "explain": "水不停地滴，石头也能被滴穿。 比喻只要有恒心，不断努力，事情就一定能成功。"
        },
        {
            "idiom": "马不停蹄",
            "explain": "比喻不停顿地向前走。"
        },
        {
            "idiom": "光明磊落",
            "explain": "磊落：心地光明坦白。 胸怀坦白，正大光明。"
        },
        {
            "idiom": "平易近人",
            "explain": "对人和蔼可亲，没有架子，使人容易接近。 也指文字浅显，容易了解。"
        },
        {
            "idiom": "坐井观天",
            "explain": "坐在井底看天。比喻眼界小，见识少。"
        },
        {
            "idiom": "正大光明",
            "explain": "心怀坦白，言行正派。"
        },
        {
            "idiom": "汗马功劳",
            "explain": "汗马：将士骑的马奔驰出汗，比喻征战劳苦。指在战场上建立战功。现指辛勤工作做出的贡献。"
        },
        {
            "idiom": "一日千里",
            "explain": "原形容马跑得很快。后比喻进展极快。"
        },
        {
            "idiom": "冰天雪地",
            "explain": "形容冰雪漫天盖地。"
        },
        {
            "idiom": "完美无缺",
            "explain": "完善美好，没有缺点。"
        },
        {
            "idiom": "同心协力",
            "explain": "心：思想；协：合。 团结一致，共同努力。"
        },
        {
            "idiom": "喜出望外",
            "explain": "望：希望，意料。 由于没有想到的好事而非常高兴。"
        },
        {
            "idiom": "雪中送炭",
            "explain": "在下雪天给人送炭取暖。比喻在别人急需时给以物质上或精神上的帮助。"
        },
        {
            "idiom": "口口声声",
            "explain": "形容一次一次地说，或经常说。"
        },
        {
            "idiom": "东倒西歪",
            "explain": "指行走不稳，身不由主。也形容物体倾斜不正。"
        },
        {
            "idiom": "顺手牵羊",
            "explain": "顺手把人家的羊牵走。比喻趁势将敌手捉住或乘机利用别人。现比喻乘机拿走别人的东西。"
        },
        {
            "idiom": "一心一意",
            "explain": "心思，意念专一"
        },
        {
            "idiom": "杯弓蛇影",
            "explain": "将映在酒杯里的弓影误认为蛇。比喻因疑神疑鬼而引起恐惧。"
        },
        {
            "idiom": "掌上明珠",
            "explain": "比喻接受父母疼爱的儿女，特指女儿。"
        },
        {
            "idiom": "鼠目寸光",
            "explain": "形容目光短浅，没有远见。"
        },
        {
            "idiom": "一日三秋",
            "explain": "三秋：三个季度。意思是一天不见面，就像过了三个季度。比喻分别时间虽短，却觉得很长。形容思念殷切。"
        },
        {
            "idiom": "一举两得",
            "explain": "做一件事得到两方面的好处。"
        },
        {
            "idiom": "天马行空",
            "explain": "1.神马在空中奔腾飞驰，多形容诗文、书法、言行等气势豪放，不受拘束。2.形容说话做事不着边际。"
        },
        {
            "idiom": "七情六欲",
            "explain": "泛指人的喜、怒、哀、乐和嗜欲等。"
        },
        {
            "idiom": "五花八门",
            "explain": "原指五行阵和八门阵。这是古代两种战术变化很多的阵势。比喻变化多端或花样繁多。"
        },
        {
            "idiom": "人山人海",
            "explain": "人群如山似海。形容人聚集得非常多。"
        },
        {
            "idiom": "一丝一毫",
            "explain": "丝、毫：十丝为一毫，十毫为一厘。一点点儿，极小或极少。"
        },
        {
            "idiom": "青红皂白",
            "explain": "皂：黑色。 青、红、黑、白四色。比喻事情的是非或原因。"
        },
        {
            "idiom": "五颜六色",
            "explain": "形容色彩复杂或花样繁多。引申为各色各样。"
        },
        {
            "idiom": "楚河汉界",
            "explain": "河汉界是历史典故，秦末楚汉争霸时期，公元前205年夏，项羽在彭城（今徐州）大败汉军，刘邦退到黄河南岸重镇荥阳，楚军乘胜追击，在荥阳一带互相攻伐长达两年之久。"
        },
        {
            "idiom": "枪林弹雨",
            "explain": "枪杆像树林，子弹像下雨。形容战斗激烈。"
        },
        {
            "idiom": "风雨同舟",
            "explain": "在狂风暴雨中同乘一条船，一起与风雨搏斗。比喻共同经历患难。"
        },
        {
            "idiom": "水平如镜",
            "explain": "水面平静的如同镜子一般。形容风平浪静的状态。"
        },
        {
            "idiom": "灯红酒绿",
            "explain": "形容寻欢作乐的腐化生活，也形容都市或娱乐场所的繁华景象。 也作“酒绿灯红”。"
        },
        {
            "idiom": "环肥燕瘦",
            "explain": "形容女子形态不同，各有各好看的地方。 也借喻艺术作品风格不同，而各有所长。"
        },
        {
            "idiom": "梁上君子",
            "explain": "梁：房梁。躲在梁上的君子。窃贼的代称。现在有时也指脱离实际、脱离群众的人。"
        },
        {
            "idiom": "排山倒海",
            "explain": "推开高山，翻倒大海。 形容力量强盛，声势浩大。"
        },
        {
            "idiom": "身首异处",
            "explain": "首：头；异：不同；处：地方。 指被杀头。"
        },
        {
            "idiom": "并驾齐驱",
            "explain": "并驾：几匹马并排拉着一辆车；齐驱：一齐快跑。 并排套着的几匹马一齐快跑。比喻彼此的力量或才能不分高下。"
        },
        {
            "idiom": "风月无边",
            "explain": "极言风景之佳胜。"
        },
        {
            "idiom": "历历在目",
            "explain": "历历：清楚，分明的样子。指远方的景物看得清清楚楚，或过去的事情清清楚楚地重现在眼前。"
        },
        {
            "idiom": "明枪暗箭",
            "explain": "比喻种种公开的和隐蔽的攻击。"
        },
        {
            "idiom": "甜言蜜语",
            "explain": "像蜜糖一样甜的话。比喻为了骗人而说的动听的话。"
        },
        {
            "idiom": "斤斤计较",
            "explain": "斤斤：形容明察，引伸为琐碎细小。只对无关紧要的事过分计较。"
        },
        {
            "idiom": "爱财如命",
            "explain": "把钱财看得跟生命一样重要。 形容极端吝啬。"
        },
        {
            "idiom": "独具慧眼",
            "explain": "能看到别人看不到的东西，形容眼光敏锐，见解高超;能作出精细判断的(如在质量方面)"
        },
        {
            "idiom": "苦尽甘来",
            "explain": "甘：甜，比喻幸福。 艰难的日子过完，美好的日子来到了。"
        },
        {
            "idiom": "文不加点",
            "explain": "点：涂上一点，表示删去。文章一气呵成，无须修改。形容文思敏捷，写作技巧纯熟。"
        },
        {
            "idiom": "生死离别",
            "explain": "不易再相见的离别"
        },
        {
            "idiom": "弃暗投明",
            "explain": "离开黑暗，投向光明。比喻在政治上脱离反动阵营，投向进步方面。"
        },
        {
            "idiom": "见风使舵",
            "explain": "看风向转发动舵柄。比喻看势头或看别人的眼色行事。"
        },
        {
            "idiom": "此起彼伏",
            "explain": "这里起来，那里下去。形容接连不断。"
        },
        {
            "idiom": "千钧一发",
            "explain": "比喻情况万分危急。"
        },
        {
            "idiom": "事半功倍",
            "explain": "指做事得法，因而费力小，收效大。"
        },
        {
            "idiom": "寸步难行",
            "explain": "连一步都难以进行。形容走路困难。也比喻处境艰难。"
        },
        {
            "idiom": "杀鸡取卵",
            "explain": "卵：蛋。为了要得到鸡蛋，不惜把鸡杀了。比喻贪图眼前的好处而不顾长远利益。"
        },
        {
            "idiom": "抖折蛇行",
            "explain": "像北斗星一样弯曲，像蛇一样曲折行进。形容道路曲折蜿蜒"
        },
        {
            "idiom": "穷山恶水",
            "explain": "穷山：荒山；恶水：经常引起灾害的河流湖泊等。 形容自然条件非常差。"
        },
        {
            "idiom": "思如泉涌",
            "explain": "才思像喷涌的泉水。 形容才思敏捷。"
        },
        {
            "idiom": "是非曲直",
            "explain": "正确还是不正确，有理还是无理。"
        },
        {
            "idiom": "夸父追日",
            "explain": "古代神话。同“夸父逐日”。"
        },
        {
            "idiom": "水天一色",
            "explain": "水光与天色相浑。 形容水天相接的辽阔景象。"
        },
        {
            "idiom": "堆积如山",
            "explain": "聚集成堆，如同小山。形容极多。"
        },
        {
            "idiom": "先礼后兵",
            "explain": "礼：礼貌；兵：武力。 先按通常的礼节同对方交涉，如果行不能，再用武力或其他强硬手段解决。"
        },
        {
            "idiom": "行将就木",
            "explain": "行将：将要；木：指棺材。指人寿命已经不长，快要进棺材了。"
        },
        {
            "idiom": "坐吃山空",
            "explain": "只坐着吃，山也要空。指光是消费而不从事生产，即使有堆积如山的财富，也要耗尽。"
        },
        {
            "idiom": "缘木求鱼",
            "explain": "缘木：爬树。爬到树上去找鱼。比喻方向或办法不对头，不可能达到目的。"
        },
        {
            "idiom": "立锥之地",
            "explain": "插锥尖的一点地方。形容极小的一块地方。也指极小的安身之处。"
        },
        {
            "idiom": "囊萤映雪",
            "explain": "原是车胤用口袋装萤火虫来照书本，孙康利用雪的反光勤奋苦学的故事。后形容刻苦攻读。"
        },
        {
            "idiom": "蚍蜉撼树",
            "explain": "蚍蜉撼树的意思是蚂蚁摇动树木，比喻不自量力，企图用微不足道的力量动摇破坏强大的事物"
        },
        {
            "idiom": "一泻千里",
            "explain": "泻：水往下直注。形容江河奔流直下，流得又快又远。也比喻文笔或乐曲气势奔放。也形容价格猛跌不止。"
        },
        {
            "idiom": "归心似箭",
            "explain": "想回家的心情像射出的箭一样快。形容回家心切。"
        },
        {
            "idiom": "捧腹大笑",
            "explain": "用手捂住肚子大笑。 形容遇到极可笑之事，笑得不能抑制。"
        },
        {
            "idiom": "鱼贯而入",
            "explain": "像游鱼一样一个跟着一个地接连着走。 形容一个接一个地依次序进入。"
        },
        {
            "idiom": "月下老人",
            "explain": "原指主管婚姻的神仙。后泛指媒人。简称“月老”。"
        },
        {
            "idiom": "鸡飞狗跳",
            "explain": "把鸡吓得飞起来，把狗吓得到处乱跳。 形容惊慌得乱成一团。"
        },
        {
            "idiom": "苟延残喘",
            "explain": "苟：暂且，勉强；延：延续；残喘：临死前的喘息。勉强延续临死前的喘息。比喻暂时勉强维持生存。"
        },
        {
            "idiom": "浑水摸鱼",
            "explain": "浑水：不清的水。比喻乘混乱的时候从中捞取利益。"
        },
        {
            "idiom": "漏网之鱼",
            "explain": "逃脱鱼网的鱼。 比喻侥幸逃脱的罪犯或敌人。"
        },
        {
            "idiom": "纸上谈兵",
            "explain": "在纸面上谈论打仗。比喻空谈理论，不能解决实际问题。也比喻空谈不能成为现实。"
        },
        {
            "idiom": "妙语连珠",
            "explain": "连珠：串珠。巧妙风趣的话一个接一个。"
        },
        {
            "idiom": "三足鼎立",
            "explain": "比喻三方面对立的局势。"
        },
        {
            "idiom": "千军万马",
            "explain": "形容雄壮的队伍或浩大的声势。"
        },
        {
            "idiom": "瓜田李下",
            "explain": "比喻容易引起嫌疑的场合。"
        },
        {
            "idiom": "目中无人",
            "explain": "眼里没有别人。 形容骄傲自大，看不起人。"
        },
        {
            "idiom": "三人成虎",
            "explain": "三个人谎报城市里有老虎，听的人就信以为真。比喻说的人多了，就能使人们把谣言当事实。"
        },
        {
            "idiom": "拨云见日",
            "explain": "拨开乌云见到太阳。 比喻冲破黑暗见到光明。也比喻疑团消除，心里顿时明白。"
        },
        {
            "idiom": "三心二意",
            "explain": "又想这样又想那样，犹豫不定。常指不安心，不专一。"
        },
        {
            "idiom": "马首是瞻",
            "explain": "瞻：往前或向上看。 看着我马头的方向，决定进退。比喻追随某人行动。"
        },
        {
            "idiom": "买椟还珠",
            "explain": "椟：木匣；珠：珍珠。买下木匣，退还了珍珠。比喻没有眼力，取舍不当。"
        },
        {
            "idiom": "乘风破浪",
            "explain": "船只乘着风势破浪前进。比喻排除困难，奋勇前进。"
        },
        {
            "idiom": "囊萤照雪",
            "explain": "形容家境贫寒，勤苦读书。"
        },
        {
            "idiom": "眉来眼去",
            "explain": "形容用眉眼传情。"
        },
        {
            "idiom": "逆流而上",
            "explain": "即逆水前进。比喻迎着困难而上。"
        },
        {
            "idiom": "平步青云",
            "explain": "平：平稳；步：行走；青云：高空。 指人一下子升到很高的地位上去。"
        },
        {
            "idiom": "骑虎难下",
            "explain": "骑在老虎背上不能下来。 比喻做一件事情进行下去有困难，但情况又不允许中途停止，陷于进退两难的境地。"
        },
        {
            "idiom": "成王败寇",
            "explain": "旧指在争夺政权斗争中，成功了的就是合法的，称帝称王；失败了的就是非法的，被称为寇贼。含有成功者权势在手，无人敢责难，失败者却有口难辩的意思。"
        },
        {
            "idiom": "泥牛入海",
            "explain": "泥塑的牛掉到海里。 比喻一去不再回来。"
        },
        {
            "idiom": "老马识途",
            "explain": "老马认识路。比喻有经验的人对事情比较熟悉。"
        },
        {
            "idiom": "芒刺在身",
            "explain": "芒刺：谷类壳上的细刺。好像有芒刺扎在身上。形容心中内心惶恐，坐立不安"
        },
        {
            "idiom": "比翼齐飞",
            "explain": "比翼：翅膀挨着翅膀。 齐飞：成双的并飞。比喻夫妻情投意合，在事业上并肩前进。"
        },
        {
            "idiom": "开膛破肚",
            "explain": "把一个生物剖开膛，刮开肚来看。"
        },
        {
            "idiom": "待字闺中",
            "explain": "字：许配；闺：女子卧室。留在闺房之中，等待许嫁。旧指女子成年待聘。"
        },
        {
            "idiom": "破口大骂",
            "explain": "用恶语骂人。"
        },
        {
            "idiom": "乌合之众",
            "explain": "像暂时聚合的一群乌鸦。 比喻临时杂凑的、毫无组织纪律的一群人。"
        },
        {
            "idiom": "颠倒黑白",
            "explain": "把黑的说成白的，白的说成黑的。 比喻歪曲事实，混淆是非。"
        },
        {
            "idiom": "四平八稳",
            "explain": "原形容身体各部位匀称、结实。 后常形容说话做事稳当。也形容做事只求不出差错，缺乏积极创新精神。"
        },
        {
            "idiom": "高高在上",
            "explain": "原指地位高，现在形容领导者脱离实际，脱离群众。"
        },
        {
            "idiom": "甘拜下风",
            "explain": "表示真心佩服，自认不如。"
        },
        {
            "idiom": "前仆后继",
            "explain": "仆：倒下；继：接着，跟上。前面的倒下了，后面的紧跟上去。形容斗争的英勇壮烈。"
        },
        {
            "idiom": "三更半夜",
            "explain": "一夜分为五更，三更是午夜十二时。指深夜。"
        },
        {
            "idiom": "背道而驰",
            "explain": "背：背向；道：道路；驰：奔跑。 朝相反的方向跑去。比喻彼此的方向和目的完全相反。"
        },
        {
            "idiom": "沧海一粟",
            "explain": "粟：谷子，即小米。 大海里的一粒谷子。比喻非常渺小。"
        },
        {
            "idiom": "姹紫嫣红",
            "explain": "姹、嫣：娇艳。形容各种花朵娇艳美丽。"
        },
        {
            "idiom": "崇山峻岭",
            "explain": "崇：高；峻：山高而陡。 高大险峻的山岭。"
        },
        {
            "idiom": "茅塞顿开",
            "explain": "茅塞：喻人思路闭塞或不懂事；顿：立刻。 原来心里好像有茅草堵塞着，现在忽然被打开了。形容思想忽然开窍，立刻明白了某个道理。"
        },
        {
            "idiom": "飞蛾扑火",
            "explain": "飞蛾扑到火上，比喻自取灭亡。"
        },
        {
            "idiom": "一塌糊涂",
            "explain": "形容混乱或败坏到了不可收拾的程度。"
        },
        {
            "idiom": "迫在眉睫",
            "explain": "形容事情已到眼前，情势十分紧迫。"
        },
        {
            "idiom": "雪上加霜",
            "explain": "比喻接连遭受灾难，损害愈加严重。"
        },
        {
            "idiom": "人满为患",
            "explain": "因人多造成了困难。"
        },
        {
            "idiom": "雌雄难辨",
            "explain": "出自木兰词 解 释 扑朔:雄兔脚毛蓬松;迷离:雌兔眼半闭。原指分辨兔子的雌雄。形容事情错综复杂,难以辨别清楚"
        },
        {
            "idiom": "化整为零",
            "explain": "把一个整体分成许多零散部分。"
        },
        {
            "idiom": "网开一面",
            "explain": "把捕禽的网撤去三面，只留一面。比喻采取宽大态度，给人一条出路。"
        },
        {
            "idiom": "离弦之箭",
            "explain": "像发射出去的箭一样冲出去，形容速度快。也比喻话说出来就不能收回，一言九鼎。"
        },
        {
            "idiom": "似是而非",
            "explain": "似：像；是：对；非：不对。好像是对的，实际上不对。"
        },
        {
            "idiom": "若即若离",
            "explain": "若：好像；即：接近。 好像接近，又好像不接近。①形容对人保持一定距离。②形容事物含混不清。"
        },
        {
            "idiom": "支离破碎",
            "explain": "支离：零散，残缺。形容事物零散破碎，不完整。"
        },
        {
            "idiom": "脱口而出",
            "explain": "不经考虑，随口说出。"
        },
        {
            "idiom": "血肉模糊",
            "explain": "血流肉烂，无法辨认器官肢体。形容死亡或受伤的惨状。"
        },
        {
            "idiom": "立竿见影",
            "explain": "在阳光下把竿子竖起来，立刻就看到影子。比喻立刻见到功效。"
        },
        {
            "idiom": "泰山压顶",
            "explain": "泰山压在头上。 比喻遭遇到极大的压力和打击。"
        },
        {
            "idiom": "弱不禁风",
            "explain": "禁：承受。 形容身体娇弱，连风吹都经受不起。"
        },
        {
            "idiom": "绿林好汉",
            "explain": "指聚集山林反抗封建统治阶级的人们。旧时也指聚众行劫的群盗股匪。"
        },
        {
            "idiom": "唇亡之寒",
            "explain": "嘴唇没有了，牙齿就会感到寒冷。 比喻利害密要相关。"
        },
        {
            "idiom": "胆大包天",
            "explain": "包：包容。 形容胆子极大。"
        },
        {
            "idiom": "断子绝孙",
            "explain": "没有儿子，也没有孙子。 指没有后代。"
        },
        {
            "idiom": "爱憎分明",
            "explain": "憎：恨。 爱和恨的立场和态度十分鲜明。"
        },
        {
            "idiom": "八面来风",
            "explain": "一个成语典故。比喻来自四面八方的信息、意见和其他资源。"
        },
        {
            "idiom": "大跌眼镜",
            "explain": "对出乎意料的结果或不可思议的事物感到非常惊讶。"
        },
        {
            "idiom": "地广人稀",
            "explain": "地方大，人烟少。"
        },
        {
            "idiom": "洞房花烛",
            "explain": "形容结婚的景象。"
        },
        {
            "idiom": "废话连篇",
            "explain": "形容文章或言谈中不必要的废话太多。"
        },
        {
            "idiom": "来历不明",
            "explain": "来历：由来。 人或事物的来历与经过不清楚。"
        },
        {
            "idiom": "劳燕分飞",
            "explain": "劳：伯劳。 伯劳、燕子各飞东西。比喻夫妻、情侣别离。"
        },
        {
            "idiom": "三姑六婆",
            "explain": "比喻不务正业的妇女。"
        },
        {
            "idiom": "三从四德",
            "explain": "封建礼教束缚妇女的道德标准之一。"
        },
        {
            "idiom": "风花雪月",
            "explain": "原指旧时诗文里经常描写的自然景物。 后比喻堆砌词藻、内容贫乏空洞的诗文。也指爱情之事或花天酒地的荒淫生活。"
        },
        {
            "idiom": "莫名其妙",
            "explain": "说不出其中的奥妙。指事情很奇怪，说不出道理来。"
        },
        {
            "idiom": "头重脚轻",
            "explain": "头脑发胀，脚下无力。形容身体不适。也比喻基础不牢固。"
        },
        {
            "idiom": "七零八落",
            "explain": "形容零散稀疏的样子。特指原来又多又整齐的东西现在零散了。"
        },
        {
            "idiom": "偷天换日",
            "explain": "比喻暗中改变事物的真相，以达到蒙混欺骗的目的。"
        },
        {
            "idiom": "出口成章",
            "explain": "说出话来就成文章。形容文思敏捷，口才好。"
        },
        {
            "idiom": "望而生畏",
            "explain": "畏：恐惧，害怕。看见了就害怕。"
        },
        {
            "idiom": "言外之意",
            "explain": "指有这个意思，但没有在话里明说出来。"
        },
        {
            "idiom": "力争上游",
            "explain": "上游：河的上流，比喻先进的地位。 努力奋斗，争取先进再先进。"
        },
        {
            "idiom": "大惊失色",
            "explain": "非常害怕，脸色都变了。"
        },
        {
            "idiom": "百步穿杨",
            "explain": "在一百步远以外射中杨柳的叶子。形容箭法或枪法十分高明。"
        },
        {
            "idiom": "妻离子散",
            "explain": "一家子被迫分离四散。"
        },
        {
            "idiom": "哑口无言",
            "explain": "哑口：像哑巴一样。像哑巴一样说不出话来。形容理屈词穷的样子。"
        },
        {
            "idiom": "独出心裁",
            "explain": "原指诗文的构思有独到的地方。后泛指想出的办法与众不同。"
        },
        {
            "idiom": "度日如年",
            "explain": "过一天像过一年那样长。 形容日子很不好过。"
        },
        {
            "idiom": "风雨交加",
            "explain": "又是刮风，又是下雨。比喻几种灾难同时袭来。"
        },
        {
            "idiom": "百年树人",
            "explain": "树：种植，栽培。比喻培养人才是长期而艰巨的事。"
        },
        {
            "idiom": "不可思议",
            "explain": "原有神秘奥妙的意思。 现多指无法想象，难以理解。"
        },
        {
            "idiom": "回头是岸",
            "explain": "佛家语，指有罪的人只要回心转意，痛改前非，就能登上“彼岸”，获得超度。后比喻做坏事的人，只要决心悔改，就有出路。"
        },
        {
            "idiom": "安然无恙",
            "explain": "恙：病。原指人平安没有疾病。现泛指事物平安未遭损害。"
        },
        {
            "idiom": "弹尽粮绝",
            "explain": "作战中弹药用完了，粮食也断绝了。指无法继续作战的危险处境。"
        },
        {
            "idiom": "岂有此理",
            "explain": "哪有这个道理。 指别人的言行或某一事物极其荒谬。"
        },
        {
            "idiom": "外圆内方",
            "explain": "圆：圆通；方：方正。比喻人表面随和，内心严正。"
        },
        {
            "idiom": "粗心大意",
            "explain": "粗：粗蔬。指做事马虎，不细心。"
        },
        {
            "idiom": "狗尾续貂",
            "explain": "续：连接。晋代皇帝的侍从官员用作帽子的装饰。指封官太滥。亦比喻拿不好的东西补接在好的东西后面，前后两部分非常不相称。"
        },
        {
            "idiom": "隔靴搔痒",
            "explain": "搔：抓。 隔着靴子搔痒痒。比喻说话作文不中肯，不贴切，没有抓住要点。或做事没有抓住关键。"
        },
        {
            "idiom": "破门而入",
            "explain": "砸开门进去。多指盗贼行为。"
        },
        {
            "idiom": "苦中作乐",
            "explain": "在困苦中勉强自寻欢乐。"
        },
        {
            "idiom": "分崩离析",
            "explain": "崩：倒塌；析：分开。 崩塌解体，四分五裂。形容国家或集团分裂瓦解。"
        },
        {
            "idiom": "难以置信",
            "explain": "不容易相信。"
        },
        {
            "idiom": "厚此薄彼",
            "explain": "重视或优待一方，轻视或怠慢另一方。 比喻对两方面的待遇不同。"
        },
        {
            "idiom": "争锋相对",
            "explain": "针锋:针尖。针尖对针尖。比喻双方在策略、论点及行动方式等方面尖锐对立。"
        },
        {
            "idiom": "家徒四壁",
            "explain": "徒：只，仅仅。 家里只有四面的墙壁。形容十分贫困，一无所有。"
        },
        {
            "idiom": "功德圆满",
            "explain": "功德：佛教用语，指诵经、布施等。多指诵经等佛事结束。比喻举办事情圆满结束。"
        },
        {
            "idiom": "改朝换代",
            "explain": "旧的朝代为新的朝代所代替。"
        },
        {
            "idiom": "不堪回首",
            "explain": "堪：可以忍受；回首：回顾，回忆。 指对过去的事情想起来就会感到痛苦，因而不忍去回忆。"
        },
        {
            "idiom": "水天一色",
            "explain": "水光与天色相浑。形容水天相接的辽阔景象。"
        },
        {
            "idiom": "天崩地裂",
            "explain": "像天塌下、地裂开那样。 比喻重大的事变。"
        },
        {
            "idiom": "棱模两可",
            "explain": "原意:模:圆的东西。棱:有角的东西。棱模两可就是指介于二者之间,泛指事物模模糊糊,说不清所以。"
        },
        {
            "idiom": "拍案叫绝",
            "explain": "拍桌子叫好。形容非常赞赏。"
        },
        {
            "idiom": "势如破竹",
            "explain": "势：气势，威力。 形势就像劈竹子，头上几节破开以后，下面各节顺着刀势就分开了。比喻节节胜利，毫无阻碍。"
        },
        {
            "idiom": "死不瞑目",
            "explain": "瞑目：闭眼。 死了也不闭眼。原指人死的时候心里还有放不下的事。现常用来形容极不甘心。"
        },
        {
            "idiom": "如坐针毡",
            "explain": "像坐在插着针的毡子上。 形容心神不定，坐立不安。"
        },
        {
            "idiom": "世代相传",
            "explain": "世代相传指祖祖辈辈传下来。"
        },
        {
            "idiom": "无中生有",
            "explain": "道家认为，天下万物生于有，有生于无。把没有的说成有。比喻毫无事实，凭空捏造。"
        },
        {
            "idiom": "左右为难",
            "explain": "左也不好，右也不是。形容无论怎样做都有难处。"
        },
        {
            "idiom": "鬼话连篇",
            "explain": "鬼话：不真实的话。连篇：一篇接一篇。满口说的全是蒙骗人的胡言乱语。"
        },
        {
            "idiom": "黑白分明",
            "explain": "黑色与白色对比鲜明。比喻事非界限很清楚。也形容字迹、画面清楚。"
        },
        {
            "idiom": "思前想后",
            "explain": "思：考虑；前：前因；后：后果。对事情发生的缘由，发展后果，作再三考虑。"
        },
        {
            "idiom": "金蝉脱壳",
            "explain": "蝉变为成虫时要脱去一层壳。比喻用计脱身，使人不能及时发觉。"
        },
        {
            "idiom": "明珠暗投",
            "explain": "原意是明亮的珍珠，暗里投在路上，使人看了都很惊奇。 比喻有才能的人得不到重视。也比喻好东西落入不识货人的手里。"
        },
        {
            "idiom": "表里如一",
            "explain": "表：外表；里：内心。表面和内心像一个东西。形容言行和思想完全一致。"
        },
        {
            "idiom": "开卷有益",
            "explain": "开卷：打开书本，指读书；益：好处。 读书总有好处。"
        },
        {
            "idiom": "命悬一线",
            "explain": "处境危险，随时可能丧失生命。"
        },
        {
            "idiom": "上下其手",
            "explain": "比喻玩弄手法，串通做弊。"
        },
        {
            "idiom": "屈指可数",
            "explain": "形容数目很少，扳着手指头就能数过来。"
        },
        {
            "idiom": "三六九等",
            "explain": "指等级和类别多，有种种差别。"
        },
        {
            "idiom": "日行千里",
            "explain": "一天能走一千里。 形容速度惊人。"
        },
        {
            "idiom": "无的放矢",
            "explain": "的：靶心；矢：箭。没有目标乱射箭。比喻说话做事没有明确目的，或不切合实际。"
        },
        {
            "idiom": "乘人不备",
            "explain": "乘:趁着。趁着别人没有防备干某事成语出处清"
        },
        {
            "idiom": "畏首畏尾",
            "explain": "畏：怕，惧。前也怕，后也怕。比喻做事胆子小，顾虑多。"
        },
        {
            "idiom": "不痛不痒",
            "explain": "既不是痛，也不是痒。原形容说不出的一种难受。现多比喻不触及实质，不切中要害，不解决问题。"
        },
        {
            "idiom": "觥筹交错",
            "explain": "觥：古代的一种酒器；筹：行酒令的筹码。酒杯和酒筹杂乱地放着。形容许多人聚会喝酒时的热闹场景。"
        },
        {
            "idiom": "无穷无尽",
            "explain": "穷：完。没有止境，没有限度。"
        },
        {
            "idiom": "水乳交融",
            "explain": "交融：融合在一起。象水和乳汁融合在一起。比喻感情很融洽或结合十分紧密。"
        },
        {
            "idiom": "火冒三丈",
            "explain": "冒：往上升。形容愤怒到极点。"
        },
        {
            "idiom": "爱屋及乌",
            "explain": "因为爱一个人而连带爱他屋上的乌鸦。比喻爱一个人而连带地关心到与他有关的人或物。"
        },
        {
            "idiom": "安身立命",
            "explain": "安身：在某处安下身来；立命：精神有所寄托。指生活有着落，精神有所寄托。"
        },
        {
            "idiom": "昂首阔步",
            "explain": "昂：仰，高抬。抬起头迈开大步向前。形容精神抖擞，意气风发。"
        },
        {
            "idiom": "狭路相逢",
            "explain": "在很窄的路上相遇，没有地方可让。后多用来指仇人相见，彼此都不肯轻易放过。"
        },
        {
            "idiom": "相濡以沫",
            "explain": "濡：沾湿；沫：唾沫。 泉水干了，鱼吐沫互相润湿。比喻一同在困难的处境里，用微薄的力量互相帮助。"
        },
        {
            "idiom": "半截入土",
            "explain": "截：段。 半段身子埋入土内。比喻人在世不久了。"
        },
        {
            "idiom": "贼喊捉贼",
            "explain": "做贼的人喊捉贼。 比喻坏人为了自己逃脱，故意制造混乱，转移目标，把别人说成是坏人。"
        },
        {
            "idiom": "仗势欺人",
            "explain": "仗：凭借，依靠。 依仗某种权势欺压人。"
        },
        {
            "idiom": "指鹿为马",
            "explain": "指着鹿，说是马。比喻故意颠倒黑白，混淆是非。"
        },
        {
            "idiom": "披星戴月",
            "explain": "身披星星，头戴月亮。形容连夜奔波或早出晚归，十分辛苦。"
        },
        {
            "idiom": "独树一帜",
            "explain": "树：立；帜：旗帜。单独树起一面旗帜。比喻独特新奇，自成一家。"
        },
        {
            "idiom": "风卷残云",
            "explain": "大风把残云卷走。 比喻一下子把残存的东西一扫而光。"
        },
        {
            "idiom": "飞黄腾达",
            "explain": "飞黄：传说中神马名；腾达：上升，引伸为发迹，宦途得意。形容骏马奔腾飞驰。比喻骤然得志，官职升得很快。"
        },
        {
            "idiom": "有眼无珠",
            "explain": "珠：眼珠。 没长眼珠子。用来责骂人瞎了眼，看不见某人或某事物的伟大或重要。"
        },
        {
            "idiom": "危在旦夕",
            "explain": "旦夕：早晨和晚上，形容时间短。形容危险就在眼前。"
        },
        {
            "idiom": "人去楼空",
            "explain": "人已离去，楼中空空。比喻故地重游时睹物思人的感慨。"
        },
        {
            "idiom": "如意算盘",
            "explain": "比喻考虑问题时从主观愿望出发，只从好的方面着想打算。"
        },
        {
            "idiom": "山盟海誓",
            "explain": "盟：盟约；誓：誓言。指男女相爱时立下的誓言，表示爱情要象山和海一样永恒不变。"
        },
        {
            "idiom": "毛手毛脚",
            "explain": "毛：举动轻率。做事粗心，不细致。"
        },
        {
            "idiom": "束之高阁",
            "explain": "高阁：储藏器物的高架。 捆起来以后放在高高的架子上。比喻放着不用。"
        },
        {
            "idiom": "玉树临风",
            "explain": "形容人风度潇洒，秀美多姿。亦作“临风玉树”。"
        },
        {
            "idiom": "天下太平",
            "explain": "处处平安无事。指大治之世。"
        },
        {
            "idiom": "弃笔从戎",
            "explain": "犹投笔从戎。指文人弃文就武。"
        },
        {
            "idiom": "窃窃私语",
            "explain": "背地里小声说话。"
        },
        {
            "idiom": "牛鬼蛇神",
            "explain": "牛头的鬼，蛇身的神。原形容虚幻怪诞。后比喻社会上形形色色的坏人。"
        },
        {
            "idiom": "夸父逐日",
            "explain": "夸父：古传说中的人名。夸父拚命追赶太阳。比喻人有大志，也比喻不自量力。"
        },
        {
            "idiom": "哭笑不得",
            "explain": "哭也不好，笑也不好。 形容很尴尬。"
        },
        {
            "idiom": "强词夺理",
            "explain": "强词：强辩；夺：争。 指无理强辩，明明没理硬说有理。"
        },
        {
            "idiom": "老牛舐犊",
            "explain": "舐：舔；犊：小牛。老牛舔小牛。比喻父母疼爱子女。"
        },
        {
            "idiom": "火烧眉毛",
            "explain": "火烧到眉毛。 比喻事到眼前，非常急迫。"
        },
        {
            "idiom": "横冲直撞",
            "explain": "乱冲乱撞，蛮横无理。"
        },
        {
            "idiom": "见缝插针",
            "explain": "比喻尽可能利用一切可以利用的空间或时间。"
        },
        {
            "idiom": "利欲熏心",
            "explain": "贪财图利的欲望迷住了心窍。"
        },
        {
            "idiom": "恨之入骨",
            "explain": "恨到骨头里去。形容痛恨到极点。"
        },
        {
            "idiom": "凿壁偷光",
            "explain": "原指西汉匡衡凿穿墙壁引邻舍之烛光读书。后用来形容家贫而读书刻苦。"
        },
        {
            "idiom": "狼烟四起",
            "explain": "狼烟：古代边防报警时烧狼粪腾起的烟。四处都是报警的烟火，指边疆不平静。"
        },
        {
            "idiom": "岳母刺字",
            "explain": "岳飞母亲为促岳飞回营抗敌，在岳飞背上刺“精忠报国”四字，使其永以报国为志，终身报效祖国。"
        },
        {
            "idiom": "五雷轰顶",
            "explain": "意思是如果做了坏事会有严重的惩罚。"
        },
        {
            "idiom": "当局者迷",
            "explain": "在一个局面里的人会被局势所困惑。表示当事人会对一件事很迷惑。"
        },
        {
            "idiom": "鸟语蝉鸣",
            "explain": "语意上是“鸟的叫声和蝉的鸣声，一般用来反衬形容环境的静"
        },
        {
            "idiom": "做贼心虚",
            "explain": "做了贼的人心里下意识会觉得心虚。比喻做了坏事的人心里总会不安。"
        },
        {
            "idiom": "满园春色",
            "explain": "形容生机勃勃春色盎然的样子。"
        },
        {
            "idiom": "心猿意马",
            "explain": "心意好像猴子跳、马奔跑一样控制不住。形容心里东想西想，安静不下来。"
        },
        {
            "idiom": "浓眉大眼",
            "explain": "又黑又密的眉毛，大大的眼睛。形容眉目有神的人。"
        },
        {
            "idiom": "乘人之危",
            "explain": "比喻在别人有危难的时候做出一些不好的事。"
        },
        {
            "idiom": "人中之龙",
            "explain": "比喻人中豪杰。"
        },
        {
            "idiom": "沧海一栗",
            "explain": "【解 释】： 沧海：大海;粟：谷子。大海里的一粒谷子。比喻非常渺小，微不足道。"
        },
        {
            "idiom": "口蜜腹剑",
            "explain": "嘴上说的很甜美，凡里却怀着害人的主意。形容两面派的狡猾阴险。"
        },
        {
            "idiom": "根深蒂固",
            "explain": "【释义】蒂：瓜、果和茎、枝相连的部分;固：牢固。比喻根基深厚牢固;不可动摇。"
        },
        {
            "idiom": "薪火相传",
            "explain": "古时候比喻形骸有尽而精神不灭;后人用来比喻学问和技艺代代相传。"
        },
        {
            "idiom": "一清二白",
            "explain": "比喻十分清白。亦比喻非常清楚。"
        },
        {
            "idiom": "全心投入",
            "explain": "：投入全部的精力，一点都不保留。"
        },
        {
            "idiom": "虎入羊群",
            "explain": "老虎跑进羊群。比喻强大者冲入柔弱者中间任意砍杀。"
        },
        {
            "idiom": "守口如瓶",
            "explain": "一个人嘴巴紧闭着不说话。比喻这个人口风很紧，说话很谨慎"
        },
        {
            "idiom": "困兽犹斗",
            "explain": "被围困的野兽还要作最后挣扎。比喻在绝境中还要挣扎抵抗。"
        },
        {
            "idiom": "德才兼备",
            "explain": "德：品德;才：才能;备：具备。既有好的思想品质，又有工作的才干和能力。"
        },
        {
            "idiom": "半夜三更",
            "explain": "一夜分为五更，三更是午夜十二时。指深夜。"
        },
        {
            "idiom": "舍生取义",
            "explain": "舍：舍弃;生：生命;取：求取;义：正义。舍弃生命以取得正义。指为正义而牺牲生命。"
        },
        {
            "idiom": "金盆洗手",
            "explain": "原指某些黑道人物发财后准备安享晚年，公开宣布改邪归正;现也指放弃以前长期从事的行业或某件事。"
        },
        {
            "idiom": "天公作美",
            "explain": "事物方面，随心如意：真是天公作美，经过多次周折，他俩终成眷属。"
        },
        {
            "idiom": "眼疾手快",
            "explain": "眼睛反应快手脚反应也快，形容做事反应快比较机警。"
        },
        {
            "idiom": "一臂之力",
            "explain": "臂：胳膊。指一部分力量或不大的力量。表示从旁帮一点忙。"
        },
        {
            "idiom": "欢笑九泉",
            "explain": "【释义】 九泉：地下深处，旧指人死之后埋葬的地方。也作：“黄泉”。在九泉之下满含笑容。表示死后也感到欣慰和高兴。"
        },
        {
            "idiom": "握手言欢",
            "explain": "握手谈笑。多形容发生不和，以后又和好。"
        },
        {
            "idiom": "鼎鼎大名",
            "explain": "形容名气很大。"
        },
        {
            "idiom": "五味俱全",
            "explain": "五味：酸甜苦辣咸的合称。形容调味齐全适宜。"
        },
        {
            "idiom": "一脉相承",
            "explain": "从同一血统、派别世代相承流传下来。批某种思想、行为或学说之间有继承关系。"
        },
        {
            "idiom": "蛇鼠一窝",
            "explain": "形容坏人互相勾结，或者形容两个相互关联的人做坏事的行径如出一辙。"
        },
        {
            "idiom": "不在话下",
            "explain": "指事物轻微，或者理所当然，不值得一提。"
        },
        {
            "idiom": "万箭穿心",
            "explain": "犹万箭攒心。形容万分伤痛。"
        },
        {
            "idiom": "兵荒马乱",
            "explain": "荒、乱：指社会秩序不安定。形容战争期间社会混乱不安的景象。"
        },
        {
            "idiom": "三思而行",
            "explain": "三：再三，表示多次。指经过反复考虑，然后再去做。"
        },
        {
            "idiom": "挥汗如雨",
            "explain": "挥：洒，泼。形容天热出汗多。"
        },
        {
            "idiom": "刀山火海",
            "explain": "比喻极其危险和困难的地方。"
        },
        {
            "idiom": "桃红柳绿",
            "explain": "桃花嫣红，柳枝碧绿。形容花木繁盛、色彩鲜艳的春景。"
        },
        {
            "idiom": "心惊肉跳",
            "explain": "形容担心灾祸临头，恐慌不安。"
        },
        {
            "idiom": "按兵不动",
            "explain": "意思是军队暂时不展开行动，比喻事情暂时不用运行。"
        },
        {
            "idiom": "怒发冲冠",
            "explain": "指愤怒得头发直竖，顶着帽子。形容极端愤怒。"
        },
        {
            "idiom": "惊慌失措",
            "explain": "【释义】"
        },
        {
            "idiom": "万家生佛",
            "explain": "旧时指受百姓爱戴的地方官。"
        },
        {
            "idiom": "空中楼阁",
            "explain": "悬在半空中的阁楼。比喻虚幻的事物或脱离实际的空想。"
        },
        {
            "idiom": "泪如雨下",
            "explain": "眼泪象雨水似的直往下流。形容悲痛或害怕之极。"
        },
        {
            "idiom": "人小鬼大",
            "explain": "【释义】：指年纪小而头脑却很精明，为人调皮，鬼主意多。多用于小孩子。"
        },
        {
            "idiom": "气贯长虹",
            "explain": "贯：贯穿。正义的精神直上高空，穿过彩虹。形容精神极其崇高，气概极其豪壮。"
        },
        {
            "idiom": "虎视眈眈",
            "explain": "眈眈：注视的样子。象老虎那样凶狠地盯着。形容心怀不善，伺机攫取。"
        },
        {
            "idiom": "三阳开泰",
            "explain": "《周易》称爻连的为阳卦，断的为阴爻，正月为泰卦，三阳生于下;冬去春来，阴消阳长，有吉亨之象。常用以称颂岁首或寓意吉祥。"
        },
        {
            "idiom": "其乐无穷",
            "explain": "其中的乐趣没有穷尽。指朝廷某一工作，感到乐在其中。"
        },
        {
            "idiom": "寿比南山",
            "explain": "寿命象终南山那样长久。用于祝人长寿。"
        },
        {
            "idiom": "哭笑不得",
            "explain": "哭也不好，笑也不好。形容很尴尬。"
        },
        {
            "idiom": "串通一气",
            "explain": "相互勾结，一个鼻孔出气。"
        },
        {
            "idiom": "犀牛望月",
            "explain": "比喻见到的不全面。"
        },
        {
            "idiom": "撞钟伐鼓",
            "explain": "指奏乐或敲击寺院的钟鼓。"
        },
        {
            "idiom": "变本加厉",
            "explain": "厉：猛烈。指比原来更加发展。现指情况变得比本来更加严重。"
        },
        {
            "idiom": "大是大非",
            "explain": "指带有原则性、根本性的是非问题。"
        },
        {
            "idiom": "若隐若现",
            "explain": "隐隐约约，看不清楚。"
        },
        {
            "idiom": "表里山河",
            "explain": "表里：即内外。外有大河，内有高山。指有山河天险作为屏障。"
        },
        {
            "idiom": "黑白颠倒",
            "explain": "比喻把黑的说成白的，白的说成黑的。比喻歪曲事实，混淆是非。"
        },
        {
            "idiom": "退避三舍",
            "explain": "舍：古时行军计程以三十里为一舍。主动退让九十里。比喻退让和回避，避免冲突。"
        },
        {
            "idiom": "史无前例",
            "explain": "历史上从来没有过的，前所未有的意思。"
        },
        {
            "idiom": "面不改色",
            "explain": "脸色不变。形容从容镇静的样子。"
        },
        {
            "idiom": "众矢之的",
            "explain": "矢：箭;的：箭靶的中心。众箭所射的靶子。比喻大家攻击的对象。"
        },
        {
            "idiom": "四书五经",
            "explain": "四书：亦称四子书，即《大学》、《中庸》、《论语》、《孟子》;五经：《诗》、《书》、《礼》、《易》、《春秋》。指儒家经典。"
        },
        {
            "idiom": "珠光宝气",
            "explain": "珠、宝：指首饰;光、气：形容闪耀着光彩。旧时形容妇女服饰华贵富丽，闪耀着珍宝的光色。"
        },
        {
            "idiom": "锒铛入狱",
            "explain": "锒铛：铁索链相撞击的声音。用铁链锁起来，投入监狱。"
        },
        {
            "idiom": "芒刺在背",
            "explain": "芒刺：指植物茎叶、果壳上的小刺或谷类壳上的细刺。如同有芒刺扎在背上。形容内心惶恐，坐立不安。"
        },
        {
            "idiom": "泰山北斗",
            "explain": "泰山：东岳，在山东省泰安市;北斗：北斗星。比喻道德高、名望重或有卓越成就为众人所敬仰的人。"
        },
        {
            "idiom": "肥头大耳",
            "explain": "一个肥胖的脑袋，两只大耳朵。形容体态肥胖，有时指小孩可爱。"
        },
        {
            "idiom": "堆积成山",
            "explain": "东西堆积得像山一样。形容极多。"
        },
        {
            "idiom": "琴棋书画",
            "explain": "弹琴、弈棋、写字、绘画。常以表示个人的文化素养。"
        },
        {
            "idiom": "动人心弦",
            "explain": "：形容事物激动人心、动人心魄。"
        },
        {
            "idiom": "苍白无力",
            "explain": "苍白：灰白。形容贫弱无力。"
        },
        {
            "idiom": "空前绝后",
            "explain": "从前没有过，今后也不会再有。夸张性地形容独一无二。"
        },
        {
            "idiom": "白日见鬼",
            "explain": "比喻出现不可能出现的事情"
        },
        {
            "idiom": "同甘共苦",
            "explain": "甘：甜。共同享受幸福，共同担当艰苦。"
        },
        {
            "idiom": "五脏六腑",
            "explain": "五脏：脾、肺、肾、肝、心;六腑：胃、大肠、小肠、三焦、膀胱、胆。人体内脏器官的统称。也比喻事物的内部情况。"
        },
        {
            "idiom": "蚍蜉撼树",
            "explain": "蚂蚁想摇动大树。比喻自不量力。"
        },
        {
            "idiom": "无言以对",
            "explain": "【意思】就是被问得哑口无言，什么话也回答不出来。"
        },
        {
            "idiom": "大快人心",
            "explain": "快：痛快。指坏人坏事受到惩罚或打击，使大家非常痛快。"
        },
        {
            "idiom": "百依百顺",
            "explain": "依、顺：顺从。什么都依从。形容一切都顺从别人。"
        },
        {
            "idiom": "枯木逢春",
            "explain": "枯：枯萎;木：树木;逢：遇上。枯树遇上春天又有了生机。比喻经历挫折又获得生机。"
        },
        {
            "idiom": "火树银花",
            "explain": "火树：火红的树;指树上挂满灯彩;银花：银白色的花。指灯光闪亮;绚丽灿烂。"
        },
        {
            "idiom": "进退两难",
            "explain": "前进和后退都难。比喻事情无法决定，因而难以行动。"
        },
        {
            "idiom": "腹背受敌",
            "explain": "腹：指前面;背：指后面。前后受到敌人的夹攻。 也指陷入困境。"
        },
        {
            "idiom": "视死如归",
            "explain": "把死看得象回家一样平常。形容不怕牺牲生命。"
        },
        {
            "idiom": "月中折桂",
            "explain": "在月亮中折桂树枝。比喻科举及第。"
        },
        {
            "idiom": "当头棒喝",
            "explain": "佛教禅宗和尚接待初学的人常常用棒一击或大喝一声，促他醒悟。比喻严厉警告，促使人猛醒过来。"
        },
        {
            "idiom": "高枕无忧",
            "explain": "垫高枕头睡觉，无忧无虑。比喻思想麻痹，丧失警惕。"
        },
        {
            "idiom": "两手空空",
            "explain": "形容人手头很紧，一个钱也没有。"
        },
        {
            "idiom": "名落孙山",
            "explain": "名字落在榜末孙山的后面。指考试或选拔没有录取。"
        },
        {
            "idiom": "一尘不染",
            "explain": "原指佛教徒修行时，排除物欲，保持心地洁净。现泛指丝毫不受坏习惯，坏风气的影响。"
        },
        {
            "idiom": "自投罗网",
            "explain": "投：进入;罗网：捕捉鱼鸟的器具。自己投到罗网里去。比喻自己送死。"
        },
        {
            "idiom": "一模一样",
            "explain": "样子完全相同。"
        },
        {
            "idiom": "万里挑一",
            "explain": "形容在众多事物中挑选出来的，即为精粹，出内拔萃。"
        },
        {
            "idiom": "红绳系足",
            "explain": "旧指男女双方经由媒人介绍而成亲。"
        },
        {
            "idiom": "张牙舞爪",
            "explain": "张：张开;舞：挥舞。形容猛兽凶恶可怕。也比喻猖狂凶恶。"
        },
        {
            "idiom": "半新半旧",
            "explain": "指不新不旧。"
        },
        {
            "idiom": "一见如故",
            "explain": "故：老朋友。初次见面就象老朋友一样合得来。"
        },
        {
            "idiom": "怒气冲天",
            "explain": "怒气冲上天空。形容愤怒到极点。"
        },
        {
            "idiom": "一箪一瓢",
            "explain": "一箪食物，一瓢饮料。形容清贫的生活。"
        },
        {
            "idiom": "汗流浃背",
            "explain": "浃：湿透。汗流得满背都是。形容非常恐惧或非常害怕。现也形容出汗很多，背上的衣服都湿透了。"
        },
        {
            "idiom": "毛遂自荐",
            "explain": "毛遂自我推荐。比喻自告奋勇，自己推荐自己担任某项工作。"
        },
        {
            "idiom": "答非所问",
            "explain": "回答的不是所问的内容。"
        },
        {
            "idiom": "积羽沉舟",
            "explain": "羽毛虽轻，积多了也能把船压沉。比喻小小的坏事积累起来就会造成严重的后果。"
        },
        {
            "idiom": "独具匠心",
            "explain": "匠心：巧妙的心思。具有独到的灵巧的心思。指在技巧和艺术方面的创造性。"
        },
        {
            "idiom": "临危不惧",
            "explain": "形容遇到危难的时候一点也不怕。"
        },
        {
            "idiom": "不欢而散",
            "explain": "散：离开，分手。很不愉快地分手。"
        },
        {
            "idiom": "饭来张口",
            "explain": "只吃饭不干活，什么都不做。"
        },
        {
            "idiom": "过河拆桥",
            "explain": "自己过了河，便把桥拆掉。比喻达到目的后，就把帮助过自己的人一脚踢开。"
        },
        {
            "idiom": "鼻青脸肿",
            "explain": "鼻子发青，脸部肿起。形容脸部伤势严重。"
        },
        {
            "idiom": "狼子野心",
            "explain": "狼子：狼崽子。狼崽子虽幼，却有凶恶的本性。比喻凶暴的人居心狠毒，习性难改。"
        },
        {
            "idiom": "心乱如麻",
            "explain": "心里乱得象一团乱麻。形容心里非常烦乱。"
        },
        {
            "idiom": "花好月圆",
            "explain": "花儿正盛开，月亮正圆满。比喻美好圆满。多用于祝贺人新婚。"
        },
        {
            "idiom": "雷厉风行",
            "explain": "厉：猛烈。象雷那样猛烈，象风那样快。比喻执行政策法令严厉迅速。也形容办事声势猛烈，行动迅速。"
        },
        {
            "idiom": "水中捞月",
            "explain": "到水中去捞月亮。比喻去做根本做不到的事情，只能白费力气。"
        },
        {
            "idiom": "推心置腹",
            "explain": "把赤诚的心交给人家。比喻真心待人。"
        },
        {
            "idiom": "白驹过隙",
            "explain": "白驹：白色骏马，比喻太阳;隙：缝隙。象小白马在细小的缝隙前跑过一样。形容时间过得极快。"
        },
        {
            "idiom": "四海升平",
            "explain": "升平：太平。天下太平。"
        },
        {
            "idiom": "矮子看戏",
            "explain": "【成语解释】比喻只知道附和别人，自己没有主见。也比喻见识不广"
        },
        {
            "idiom": "作茧自缚",
            "explain": "蚕吐丝作茧，把自己裹在里面。比喻做了某件事，结果使自己受困。也比喻自己给自己找麻烦。"
        },
        {
            "idiom": "耳聪目明",
            "explain": "聪：听觉灵敏;明：眼力敏锐。听得清楚，看得明白。形容头脑清楚，眼光敏锐。"
        },
        {
            "idiom": "残兵败将",
            "explain": "战败了的部队。残：伤，不完整。有时也比喻样子惨不忍睹，不堪入目。"
        },
        {
            "idiom": "骨瘦如柴",
            "explain": "形容消瘦到极点。同“骨瘦如豺”。"
        },
        {
            "idiom": "翻江倒海",
            "explain": "原形容雨势大，后形容力量或声势非常壮大。"
        },
        {
            "idiom": "五谷杂粮",
            "explain": "《黄帝内经》中认为五谷即“粳米、小豆、麦、大豆、黄黍”，而在《孟子滕文公》中称五谷为“稻、黍、稷、麦、菽”"
        },
        {
            "idiom": "四海为家",
            "explain": "什么地方都可以当做自己的家，指志在四方，不留恋家乡或个人的小天地。"
        },
        {
            "idiom": "一丝不苟",
            "explain": "形容办事认真，连最细微的地方也不马虎。"
        },
        {
            "idiom": "学富五车",
            "explain": "五车：指五车书。形容读书多，学识丰富。"
        },
        {
            "idiom": "积甲如山",
            "explain": "兵甲堆叠如山。极言其多。同“积甲山齐”。"
        },
        {
            "idiom": "大腹便便",
            "explain": "便便：肥胖的样子。形容肥胖的样子。"
        },
        {
            "idiom": "博大精深",
            "explain": "博：广，多，形容思想和学识广博高神。"
        },
        {
            "idiom": "十室九空",
            "explain": "室：人家。十家有九家一无所有。形容人民大量死亡或逃亡后的荒凉景象。"
        },
        {
            "idiom": "雌雄同体",
            "explain": "是雌雄异体现象的反义词。即在一个动物体中雌、雄性状都明显的现象。"
        },
        {
            "idiom": "梦寐以求",
            "explain": "寐：睡着。做梦的时候都在追求。形容迫切地期望着。"
        },
        {
            "idiom": "了如指掌",
            "explain": "了：明白;指掌：指着手掌。形容对事物了解得非常清楚，象把东西放在手掌里给人家看一样。"
        },
        {
            "idiom": "爱恨分明",
            "explain": "爱和恨的立场和态度十分鲜明。"
        },
        {
            "idiom": "九死一生",
            "explain": "九：表示极多。①形容处于极其危险的境地。②谓十死其九。形容幸免于死的人很少。③谓濒临死亡。④形容经历极大危险而幸存。"
        },
        {
            "idiom": "分道扬镳",
            "explain": "分路而行。比喻目标不同，各走各的路或各干各的事。"
        },
        {
            "idiom": "大难临头",
            "explain": "难：灾祸;临：来到。大祸落到头上。"
        },
        {
            "idiom": "旁敲侧击",
            "explain": "比喻说话、写文章不从正面直接点明，而是从侧面曲折地加以讽刺或抨击。"
        },
        {
            "idiom": "狐死首丘",
            "explain": "狐狸死了之后还会回到家乡，古代传说狐狸如果死在外面，一定把头朝着它的洞穴。比喻不忘本或怀念故乡，也比喻对故国、故乡的思念。"
        },
        {
            "idiom": "卸磨杀驴",
            "explain": "磨完东西后，把拉磨的驴卸下来杀掉。比喻把曾经为自己出过力的人一脚踢开。"
        },
        {
            "idiom": "司马青衫",
            "explain": "司马：古代官名，唐代诗人白居易曾贬官为江州司马。司马的衣衫为泪水所湿。形容极度悲伤。"
        },
        {
            "idiom": "出言不逊",
            "explain": "逊：谦让，恭顺，有礼貌。全句意为指某人说话态度傲慢粗暴无礼，言语不客气"
        },
        {
            "idiom": "鸡犬不宁",
            "explain": "宁：安宁。形容骚扰得厉害，连鸡狗都不得安宁。"
        },
        {
            "idiom": "一落千丈",
            "explain": "原指琴声陡然降落。后用来形容声誉、地位或经济状况急剧下降。"
        },
        {
            "idiom": "别出心裁",
            "explain": "别：另外;心裁：心中的设计、筹划。另有一种构思或设计。指想出的办法与众不同。"
        },
        {
            "idiom": "鸿毛泰山",
            "explain": "比喻轻重相差极大。"
        },
        {
            "idiom": "一鼓作气",
            "explain": "一鼓：第一次击鼓;作：振作;气：勇气。第一次击鼓时士气振奋。比喻趁劲头大的时候鼓起干劲，一口气把工作做完。"
        },
        {
            "idiom": "红颜薄命",
            "explain": "红颜：美女的容颜;薄命：命运不好。旧时指女子容貌美丽但遭遇不好(多指早死、寡居或丈夫不好)。"
        },
        {
            "idiom": "沐猴而冠",
            "explain": "沐猴：猕猴;冠：戴帽子。猕猴装扮成人样。比喻徒有仪表或地位而无真本领;也可形容坏人装扮成好人。"
        },
        {
            "idiom": "落草为寇",
            "explain": "寇：盗贼。旧指逃入山林做强盗。"
        },
        {
            "idiom": "趁火打劫",
            "explain": "指在别人危难的时候对别人进行抢劫，比喻乘人之危谋取私利。"
        },
        {
            "idiom": "坚如磐石",
            "explain": "坚：坚固，结实;磐：大石头。像大石头一样坚固。比喻不可动摇。"
        },
        {
            "idiom": "珠联璧合",
            "explain": "璧：平圆形中间有孔的玉。珍珠联串在一起，美玉结合在一块。比喻杰出的人才或美好的事物结合在一起。"
        },
        {
            "idiom": "走漏风声",
            "explain": "消息被透漏出去。"
        },
        {
            "idiom": "咬牙切齿",
            "explain": "切齿：咬紧牙齿;表示痛恨。形容愤恨或发狠到极点的神情。"
        },
        {
            "idiom": "一窍不通",
            "explain": "窍：洞，指心窍。没有一窍是贯通的。比喻一点儿也不懂。"
        },
        {
            "idiom": "胡说八道",
            "explain": "没有根据或没有道理地瞎说。"
        },
        {
            "idiom": "闭关锁国",
            "explain": "闭关：封闭关口;锁：封锁。闭关自守，不与外国往来。"
        },
        {
            "idiom": "铁石心肠",
            "explain": "心肠硬得象铁和石头一样。形容心肠很硬，不为感情所动。"
        },
        {
            "idiom": "喜怒哀乐",
            "explain": "喜欢、恼怒、悲哀、快乐。泛指人的各种不同的感情。"
        },
        {
            "idiom": "一目了然",
            "explain": "目：看;了然：清楚，明白。一眼就看得很清楚。"
        },
        {
            "idiom": "惊弓之鸟",
            "explain": "被弓箭吓怕了的鸟不容易安定。比喻经过惊吓的人碰到一点动静就非常害怕。"
        },
        {
            "idiom": "囊萤照读",
            "explain": "用口袋装萤火虫，照着读书。形容家境贫寒，勤苦读书。"
        },
        {
            "idiom": "一草一木",
            "explain": "比喻极微小的东西。"
        },
        {
            "idiom": "两袖清风",
            "explain": "衣袖中除清风外，别无所有。比喻做官廉洁。也比喻穷得一无所有。"
        },
        {
            "idiom": "一箭双雕",
            "explain": "原指射箭技术高超，一箭射中两只雕。后比喻做一件事达到两个目的。"
        },
        {
            "idiom": "缘木取鱼",
            "explain": "缘木：爬树。爬到树上去找鱼。比喻方向或办法不对头，不可能达到目的。"
        },
        {
            "idiom": "遮风挡雨",
            "explain": "遮挡风雨，比喻起保护作用。"
        },
        {
            "idiom": "一蛇吞象",
            "explain": "一条蛇想吞吃一条大象。比喻人心不足，贪得无厌。"
        },
        {
            "idiom": "横行霸道",
            "explain": "横行：行动蛮横仗势做坏事;霸道：蛮不讲理。依仗权势为非作歹。"
        },
        {
            "idiom": "如花似玉",
            "explain": "像花和玉那样美好。形容女子姿容出众。"
        },
        {
            "idiom": "七步成诗",
            "explain": "称人才思敏捷。"
        },
        {
            "idiom": "三心两意",
            "explain": "常指不安心，不专一。同“三心二意”。"
        },
        {
            "idiom": "倒背如流",
            "explain": "背：背诵。把书或文章倒过来背，背得像流水一样流畅。形容背得非常熟练，记得非常牢。"
        },
        {
            "idiom": "孔融让梨",
            "explain": "孔融让梨表示做事要知长幼，懂礼貌，应该懂得谦让。"
        },
        {
            "idiom": "刻舟求剑",
            "explain": "比喻不懂事物已发展变化而仍静止地看问题。"
        },
        {
            "idiom": "万无一失",
            "explain": "失：差错。指非常有把握，绝对不会出差错。"
        },
        {
            "idiom": "朝思暮想",
            "explain": "朝：早晨;暮：晚上。早晚都想念。形容非常想念或经常想着某一件事。"
        },
        {
            "idiom": "糖衣炮弹",
            "explain": "用糖衣裹着的炮弹;比喻用腐蚀、拉拢、诱惑等手段去牟取自己的利益。"
        },
        {
            "idiom": "秦晋之好",
            "explain": "春秋时，秦晋两国不止一代互相婚嫁。泛指两家联姻。"
        },
        {
            "idiom": "半新不旧",
            "explain": "指既不新又不旧，即半新半旧。"
        },
        {
            "idiom": "自讨苦吃",
            "explain": "讨：招惹。自己找苦吃。"
        },
        {
            "idiom": "乐在其中",
            "explain": "喜欢做某事，并在其中获得乐趣。"
        },
        {
            "idiom": "花容月貌",
            "explain": "如花似月的容貌。形容女子美貌。"
        },
        {
            "idiom": "削足适履",
            "explain": "适：适应;履：鞋。因为鞋小脚大，就把脚削去一块来凑和鞋的大小。比喻不合理的牵就凑合或不顾具体条件，生搬硬套。"
        },
        {
            "idiom": "上行下效",
            "explain": "效：仿效，跟着学。上面的人怎么做，下面的人就跟着怎么干。"
        },
        {
            "idiom": "牛郎织女",
            "explain": "牛郎织女为神话人物，从牵牛星、织女星的星名衍化而来。比喻分居两地的夫妻。也泛指一对恋人。"
        },
        {
            "idiom": "天兵天将",
            "explain": "旧指天上的军队和将领。也比喻本领高强的人们。"
        },
        {
            "idiom": "有生之年",
            "explain": "一生之中最后的年月，即余年。"
        },
        {
            "idiom": "金玉良缘",
            "explain": "原指符合封建秩序的姻缘。后泛指美好的姻缘。"
        },
        {
            "idiom": "喜从天降",
            "explain": "比喻油耗是即将发生或者已经发生。"
        },
        {
            "idiom": "拍手称快",
            "explain": "快：痛快。拍掌叫好。多指正义得到伸张或事情的结局使人感到满意。"
        },
        {
            "idiom": "歪门邪道",
            "explain": "指不正当的门径。也比喻坏主意。"
        },
        {
            "idiom": "三生有幸",
            "explain": "三生：佛家指前生、今生、来生;幸：幸运。三世都很幸运。比喻非常幸运。"
        },
        {
            "idiom": "蛇蝎心肠",
            "explain": "蝎：一种蜘蛛类的毒虫。形容心肠狠毒。"
        },
        {
            "idiom": "食指大动",
            "explain": "原指有美味可吃的预兆，后形容看到有好吃的东西而贪婪的样子。"
        },
        {
            "idiom": "酩酊大醉",
            "explain": "酩酊：沉醉的样子。形容醉得很厉害。"
        },
        {
            "idiom": "车载斗量",
            "explain": "载：装载。用车载，用斗量。形容数量很多，不足为奇。"
        },
        {
            "idiom": "万众一心",
            "explain": "千万人一条心。形容团结一致。"
        },
        {
            "idiom": "蓬荜生辉",
            "explain": "蓬荜：编蓬草、荆竹为门，形容穷苦人家。使寒门增添光辉(多用作宾客来到家里，或赠送可以张挂的字画等物的客套话)。"
        },
        {
            "idiom": "不分彼此",
            "explain": "彼：那，对方；此：这，我方。不分这个和那个。形容关系密切，交情深厚。"
        },
        {
            "idiom": "残羹剩饭",
            "explain": "吃剩的饭菜，比喻别人取用后剩下的一点儿东西。"
        },
        {
            "idiom": "倾盆大雨",
            "explain": "倾：全部倒出。雨大得像盆里的水倒下来。"
        },
        {
            "idiom": "提心吊胆",
            "explain": "吊：悬着；不塌实。心和胆好像悬起来；不塌实。形容十分担心或害怕。"
        },
        {
            "idiom": "添油加醋",
            "explain": "添油加醋：比喻叙述事情或转述别人的话，为了夸大，添上原来没有的内容。"
        },
        {
            "idiom": "笨鸟先飞",
            "explain": "笨拙的鸟先飞起来；比喻能力差的人做事时；害怕落到别人后面；比别人先着手做事。也作“夯鸟先飞”。"
        },
        {
            "idiom": "对症下药",
            "explain": "症：病症；下药：用药。医生针对病人的病情开方用药。比喻针对具体情况；采取具体有效措施。"
        },
        {
            "idiom": "十万火急",
            "explain": "形容事情紧急到了极点。"
        },
        {
            "idiom": "手无寸铁",
            "explain": "寸铁：指短小的武器。手里没有任何武器。"
        },
        {
            "idiom": "蹑手蹑脚",
            "explain": "蹑：放轻脚步。形容动作很轻；有时指走路时非常小心；或偷偷地跟随。"
        },
        {
            "idiom": "肝胆相照",
            "explain": "肝胆相照：肝与胆关系密切，互相照应。比喻互相坦诚交往共事。"
        },
        {
            "idiom": "搬弄是非",
            "explain": "搬弄：挑拨；是非：指口舌纷争。把别人的话搬来弄去；有意从中挑拨是非出来。"
        },
        {
            "idiom": "刀光剑影",
            "explain": "刀的闪光；剑的投影。表示拿刀持剑的人将要动手；显出杀气腾腾的样子。现用于坏人就要行凶；干坏事。也形容激烈斗争的场面。"
        },
        {
            "idiom": "画饼充饥",
            "explain": "画个饼子以解饥饿。比喻徒有虚名而无实惠。也比喻借空想安慰自己。"
        },
        {
            "idiom": "祸不单行",
            "explain": "祸：灾难；行：到来。灾祸的到来不只是一次。指不幸的事接二连三地到来。"
        },
        {
            "idiom": "闭门造车",
            "explain": "原意指只要按照同一规格；关起门来造成的车子；用起来也能合辙。现用以比喻不进行调查研究；只凭主观想象办事；不符合客观实际。"
        },
        {
            "idiom": "歌功颂德",
            "explain": "颂扬功绩和德行。现多含阿谀奉承的意思。功：功绩。德：德行。"
        },
        {
            "idiom": "戒骄戒躁",
            "explain": "戒：警惕；防备；躁：性急；警惕骄傲；防备急躁。"
        },
        {
            "idiom": "狼号鬼哭",
            "explain": "形容哭声凄惨"
        },
        {
            "idiom": "曲径通幽",
            "explain": "曲径通幽：弯曲的小路通到幽深僻静的地方。"
        },
        {
            "idiom": "两虎相斗",
            "explain": "比喻力量强大的双方相搏斗。"
        },
        {
            "idiom": "人老珠黄",
            "explain": "旧时比喻女子老了被轻视，就象因年代久远而失去光泽的珍珠一样不值钱。"
        },
        {
            "idiom": "一刻千金",
            "explain": "一刻：指极短的时间。比喻时间极其宝贵。"
        },
        {
            "idiom": "鳞次栉比",
            "explain": "鳞次：像鱼鳞那样挨着。栉比：像篦子齿那样并排着。形容像鱼鳞或梳篦的齿那样紧密的排列着。多用以形容房屋或船只密集。"
        },
        {
            "idiom": "一望无际",
            "explain": "一眼看不到边（际：边）。形容极其辽阔。"
        },
        {
            "idiom": "婆婆妈妈",
            "explain": "形容人动作琐细，言语罗唆。也形容人感情脆弱。"
        },
        {
            "idiom": "完璧归赵",
            "explain": "让完好无损的璧回归赵国。比喻把物品完好地归还原主。完：完整无损；璧：宝玉；赵：赵国。"
        },
        {
            "idiom": "妇孺皆知",
            "explain": "孺：儿童。妇：妇女。妇女和儿童都知道，指知名度高。形容大家都知道或一看就明白了的简单事物。"
        },
        {
            "idiom": "呱呱坠地",
            "explain": "形容婴儿出生或事物问世"
        },
        {
            "idiom": "引狼入室",
            "explain": "引：招引；把狼引到室内。比喻自己把坏人或敌人招引进来。"
        },
        {
            "idiom": "不识大体",
            "explain": "识：懂得；大体：重要的道理；关系全局的道理。指不能认清大局；不懂得做事、处理问题从整体和长远利益出发。"
        },
        {
            "idiom": "双喜临门",
            "explain": "谓两年喜事一齐到来。"
        },
        {
            "idiom": "一笔勾销",
            "explain": "勾销：取消；抹掉。用笔在书面材料上勾画一下；表示事情已经了结或取消。比喻把一切完全取消；一概不计较。"
        },
        {
            "idiom": "图穷匕见",
            "explain": "比喻到最后露出了事物的真相或本来的目的。穷：尽；匕：匕首；短剑。"
        },
        {
            "idiom": "蜂拥而上",
            "explain": "像成群的蜂拥挤着飞过来一样。形容许多人一起涌上前。"
        },
        {
            "idiom": "一筹莫展",
            "explain": "筹：计策；办法；展：施展。一点计策也施展不出；一点办法也想不出来。"
        },
        {
            "idiom": "城下之盟",
            "explain": "盟：盟约；和约。因强敌兵临城下而被迫签订的屈辱性和约。"
        },
        {
            "idiom": "鬼哭狼嚎",
            "explain": "嚎：大声叫或哭喊。像鬼和狼一样哭喊。形容哭声很凄惨。"
        },
        {
            "idiom": "快马加鞭",
            "explain": "对本来跑得很快的马再打几鞭。比喻快上加快。"
        },
        {
            "idiom": "吉祥如意",
            "explain": "祥：祥瑞。吉利祥和；万事如意。多用祝颂他人美满称心。"
        },
        {
            "idiom": "关门大吉",
            "explain": "指商店倒闭或企业破产停业。"
        },
        {
            "idiom": "张冠李戴",
            "explain": "冠：帽子。把姓张的帽子给姓李的戴上。比喻弄错了事实或对象。"
        },
        {
            "idiom": "唇枪舌剑",
            "explain": "嘴唇像枪；舌头像剑。形容能言善辩；言词犀利；针锋相对。也作“舌剑唇枪。”"
        },
        {
            "idiom": "飞来横祸",
            "explain": "飞来横祸：指突然降临的、意想不到的灾难、祸患。"
        },
        {
            "idiom": "一诺千金",
            "explain": "许下的一个诺言有千金的价值。比喻说话算数；极有信用。"
        },
        {
            "idiom": "冰雪聪明",
            "explain": "比喻人聪明非凡。"
        },
        {
            "idiom": "天罗地网",
            "explain": "天空和地面所张设的罗网。比喻严密的包围圈。多指对敌人、逃犯的严密的防范。罗：捕鸟的网。"
        },
        {
            "idiom": "龙凤呈祥",
            "explain": "指吉庆之事。"
        },
        {
            "idiom": "扫地出门",
            "explain": "扫地出门：比喻将坏东西彻底清除出去。也比喻没收全部财产，赶出家门。"
        },
        {
            "idiom": "打抱不平",
            "explain": "在双方争执中；主动介入；帮助受到欺压的人；打击实施强暴者。"
        },
        {
            "idiom": "悬梁刺股",
            "explain": "形容刻苦学习。"
        },
        {
            "idiom": "趁热打铁",
            "explain": "趁：利用机会。铁要趁烧红的时候打。比喻要抓紧有利的时机和条件去做。"
        },
        {
            "idiom": "形形色色",
            "explain": "形容事物类别很多；各种各样的都有。形形：原指生出这种形体；色色：原指生出这种颜色。"
        },
        {
            "idiom": "水深火热",
            "explain": "像水那样越来越深，像火那样越来越热。比喻人民生活极端痛苦。"
        },
        {
            "idiom": "一知半解",
            "explain": "很贫乏的知识；很肤浅的理解。形容知道得不多；理解得不深。"
        },
        {
            "idiom": "齐心协力",
            "explain": "协力：合力。心往一块想；劲往一处使。"
        },
        {
            "idiom": "滴水穿石",
            "explain": "滴水可把石头打穿。比喻虽然力量小；但只要坚持不懈；就能把艰难的事情办成。也作“水滴石穿”。"
        },
        {
            "idiom": "一厢情愿",
            "explain": "指单方面的愿望或不考虑客观实际情况的主观意愿。同“一相情愿”。"
        },
        {
            "idiom": "口直心快",
            "explain": "想什么说什么，为人直爽"
        },
        {
            "idiom": "左思右想",
            "explain": "左思右想：多方面想了又想。形容反复思考。"
        },
        {
            "idiom": "若有若无",
            "explain": "形容事物不清晰或关系不亲密。"
        },
        {
            "idiom": "江郎才尽",
            "explain": "比喻才思减退。原指江淹少有文名，晚年诗文无佳句。比喻人的文采思情衰退。"
        },
        {
            "idiom": "可歌可泣",
            "explain": "可：值得；歌：歌颂；赞扬；泣：流泪。形容英勇悲壮的事迹值得歌颂；并令人感动的流泪。"
        },
        {
            "idiom": "忠言逆耳",
            "explain": "诚恳的劝告听起来不舒服。逆：不顺。"
        },
        {
            "idiom": "市井小人",
            "explain": "指城市中庸俗鄙陋之人。"
        },
        {
            "idiom": "成年累月",
            "explain": "一年又一年，一月又一月。形容时间长久"
        },
        {
            "idiom": "歪七扭八",
            "explain": "歪歪扭扭，不直"
        },
        {
            "idiom": "六亲不认",
            "explain": "六亲：父、母、兄、弟、妻、子。不认所有亲属。形容不通人情世故；也指对谁都不讲情面；不徇私情。"
        },
        {
            "idiom": "举案齐眉",
            "explain": "案：有脚的托盘。汉代的梁鸿、孟光是一对恩爱夫妻；孟光在给梁鸿送饭时总是把端饭的盘子举得与眉毛一样高；以示对梁鸿的尊敬。后用以形容夫妻相互敬爱。"
        },
        {
            "idiom": "见仁见智",
            "explain": "对同一个问题，不同的人从不同的立场或角度有不同的看法。"
        },
        {
            "idiom": "大打出手",
            "explain": "指以一个主要人物为中心；同时与几个人对打；互相投掷、接踢武器的武打场面。现多形容野蛮地逞凶打人或互相争斗殴打（大：表示程度、规模之甚）。"
        },
        {
            "idiom": "呆如木鸡",
            "explain": "见“呆若木鸡”。"
        },
        {
            "idiom": "以德报怨",
            "explain": "拿恩惠报答仇恨。形容对人宽容；不仅不记仇；反而给以好处。"
        },
        {
            "idiom": "饥不择食",
            "explain": "择：挑拣。肚子饿了，就不再挑拣什么东西，不管什么都吃。比喻需要急迫，顾不得选择。"
        },
        {
            "idiom": "海枯石烂",
            "explain": "枯：枯干；烂：朽烂。海水干涸；石头朽烂。形容经历极长的时间或不可能实现。多用作誓言；表示意志坚定；永不改变。也作“石烂海枯”。"
        },
        {
            "idiom": "鸟枪换炮",
            "explain": "形容情况或条件有很大的好转。"
        },
        {
            "idiom": "东拼西凑",
            "explain": "东一点、西一点零零碎碎地拼凑起来"
        },
        {
            "idiom": "冤家路窄",
            "explain": "冤家：仇人。仇人在狭路上相遇；来不及回避。"
        },
        {
            "idiom": "斜风细雨",
            "explain": "形容小的风雨。斜风：旁侧吹来的小风；细雨：小雨。"
        },
        {
            "idiom": "万紫千红",
            "explain": "形容百花齐放；色彩艳丽的景象。现多比喻事物丰富多彩或景象繁荣兴旺。"
        },
        {
            "idiom": "无稽之谈",
            "explain": "稽：音机；查考；谈：话语；传言。没有根据的说法。"
        },
        {
            "idiom": "人心不古",
            "explain": "古：指古代的社会风尚。旧时指人心奸诈、刻薄，没有古人淳厚。"
        },
        {
            "idiom": "盖棺定论",
            "explain": "指一个人的是非功过到死后才能做出结论。同“盖棺论定”。"
        },
        {
            "idiom": "脍炙人口",
            "explain": "脍：细切的肉；炙：烤熟的肉。肉菜味道鲜美；使人爱吃。"
        },
        {
            "idiom": "毛骨悚然",
            "explain": "毛：头发和汗毛；骨：指脊背；悚然：害怕的样子。毛发竖起；脊骨透寒。形容非常恐惧惊骇。"
        },
        {
            "idiom": "信口雌黄",
            "explain": "信：任凭，听任；雌黄：鸡冠石；黄赤色。古时写字用黄纸；写错了就用雌黄涂了重写。指不顾事实，随口乱说或妄作评论。"
        },
        {
            "idiom": "漫不经心",
            "explain": "漫：随便；不受约束；经心：在意；留心。说话办事不用心考虑；随随便便；不在乎。"
        },
        {
            "idiom": "弹丸之地",
            "explain": "像弹子一样大的一块地方。形容地盘非常狭小。"
        },
        {
            "idiom": "世外桃源",
            "explain": "借指一种空想的脱离现实斗争的美好世界。世外桃源是一个人间生活理想境界的代名词，相当于西方的极乐世界或者天堂。"
        },
        {
            "idiom": "崭露头角",
            "explain": "崭：突出；露：显露。头上的角已明显地突出来了。指初显露优异的才能。"
        },
        {
            "idiom": "全军覆没",
            "explain": "覆没：船翻沉。整个军队被消灭。比喻遭到彻底失败。"
        },
        {
            "idiom": "黔驴技穷",
            "explain": "黔：今贵州省一带；技：技能；穷：尽。比喻有限的一点本领也已经用完了。"
        },
        {
            "idiom": "阴错阳差",
            "explain": "原为阴阳家术语；指把阴和阳搞错了。现比喻各种偶然的因素凑在一起而造成差错。"
        },
        {
            "idiom": "听而不闻",
            "explain": "闻：听。意思：听到了就像没听到一样。形容漠不关心，不在意。"
        },
        {
            "idiom": "锦囊佳句",
            "explain": "指优美的文句"
        },
        {
            "idiom": "儿女情长",
            "explain": "儿女：男女。比喻男女之间或家人之间的感情深厚；难舍难分。"
        },
        {
            "idiom": "明目张胆",
            "explain": "张胆：放大胆量。原来形容有胆有识；敢作敢为。现在形容干坏事毫无顾忌；公开放肆。"
        },
        {
            "idiom": "半路出家",
            "explain": "半路：路途走到一半；指成年以后；出家：离家去当和尚、尼姑。不是从小而是年岁大点才去当和尚、尼姑或道士的。泛指半路上才学着干某一行不是本行出身。"
        },
        {
            "idiom": "黄道吉日",
            "explain": "迷信认为宜于办事的好日子。"
        },
        {
            "idiom": "蒙在鼓里",
            "explain": "比喻受人蒙蔽，对有关的事情一点儿也不知道。"
        },
        {
            "idiom": "翻云覆雨",
            "explain": "翻覆：翻转。翻过去是云；翻过来是雨。比喻反复无常或玩弄权术和手段。"
        },
        {
            "idiom": "粉身碎骨",
            "explain": "全身粉碎。多指为了某种目的而不惜牺牲生命。也比喻彻底遭到失败或遭遇极大的磨难。"
        },
        {
            "idiom": "降龙伏虎",
            "explain": "比喻有极大能力；能够战胜很强的对手或克服很大的困难。"
        },
        {
            "idiom": "长袖善舞",
            "explain": "袖子长，有利于起舞。原指有所依靠，事情就容易成功。后形容有财势会耍手腕的人，善于钻营，会走门路。"
        },
        {
            "idiom": "众口铄金",
            "explain": "人人这么说；足以熔化金（铄：熔化）。比喻舆论力量大；也比喻谣言多使是非混淆。"
        },
        {
            "idiom": "凶神恶煞",
            "explain": "原指凶恶的神。后来指凶恶的坏人。煞：迷信说法中的凶神。"
        },
        {
            "idiom": "异想天开",
            "explain": "异：奇异、奇特；天开：比喻凭空的；根本没有的事情。形容想法非常离奇、荒唐。或指解放思想。"
        },
        {
            "idiom": "天女散花",
            "explain": "《维摩诘经·观众生品》中记载；以天女散花度菩萨和弟子的道行。后比喻大雪纷飞或抛洒东西的景象。"
        },
        {
            "idiom": "说三道四",
            "explain": "道：说。指任意乱说乱讲；惹是生非。"
        },
        {
            "idiom": "良禽择木",
            "explain": "比喻贤者择主而事。"
        },
        {
            "idiom": "投桃报李",
            "explain": "意思是他送给我桃儿，我以李子回赠他。比喻友好往来或互相赠送东西。"
        },
        {
            "idiom": "不拘小节",
            "explain": "不拘：不拘泥；不限制；小节：琐碎的生活小事。不拘泥于生活琐事。指人在生活小事上不大在乎。"
        },
        {
            "idiom": "登高一呼",
            "explain": "比喻有影响的人物发出倡议。"
        },
        {
            "idiom": "无人问津",
            "explain": "津：渡口。没有人来问渡口。比喻无人过问。"
        },
        {
            "idiom": "程门立雪",
            "explain": "旧指学生恭敬受教。比喻尊师。"
        },
        {
            "idiom": "人神共愤",
            "explain": "人和神都愤恨。形容民愤极大。"
        },
        {
            "idiom": "一鸣惊人",
            "explain": "比喻平时没有突出的表现；一下子做出惊人的成绩。"
        },
        {
            "idiom": "无往不胜",
            "explain": "往：到。所到之处；没有不胜利的。指在各处都行得通；办得好；能取得成功。"
        },
        {
            "idiom": "不胫而走",
            "explain": "胫：小腿；走：快跑。没有腿却能跑得很快。后形容事物不待推行；就到处流传。"
        },
        {
            "idiom": "目光如炬",
            "explain": "目光发亮象火炬。形容愤怒地注视着。也形容见识远大。"
        },
        {
            "idiom": "庸人自扰",
            "explain": "平庸的人无事生事；自找麻烦。"
        },
        {
            "idiom": "闲云野鹤",
            "explain": "闲：无拘束。飘浮的云，野生的鹤。旧指生活闲散、脱离世事的人。"
        },
        {
            "idiom": "执法如山",
            "explain": "执行法令像山一样不可动摇。形容执法严厉。"
        },
        {
            "idiom": "有机可乘",
            "explain": "机：机会；乘：趁。有空子可钻。指客观上提供了可以用来达到某种目的的机会。"
        },
        {
            "idiom": "如履薄冰",
            "explain": "好像踩着薄薄的冰。比喻在危险的境地而提心吊胆。"
        },
        {
            "idiom": "东窗事发",
            "explain": "现泛指阴谋败露或秘密勾当被发觉。"
        },
        {
            "idiom": "良药苦口",
            "explain": "良：好；苦口：口味苦。有疗效的好药往往味苦难吃。比喻劝诫、批评的话；虽然听起来不舒服；但很有益处。"
        },
        {
            "idiom": "心灰意冷",
            "explain": "灰心失望，意志消沉。"
        },
        {
            "idiom": "调虎离山",
            "explain": "设计让老虎离开原来的山头。比喻用计谋引诱对方离开原来有利的地势。"
        },
        {
            "idiom": "春暖花开",
            "explain": "春天气候温暖；百花盛开。形容美丽的景色。比喻事物得以顺利发展的良好环境或机遇。"
        },
        {
            "idiom": "招财进宝",
            "explain": "古时多用于社会交往，传递感情，表达寄托吉祥，除凶避邪的良好愿望和对幸福生活的美好追求。反映了古代民间风尚和习俗。"
        },
        {
            "idiom": "大逆不道",
            "explain": "逆：背叛；不道：违背当时的道德标准。旧指不符合封建统治者的道德标准和宗法观念的极端叛逆行为；给起来造反的人所加的罪名。现也用来指不合某种观念和道德标准的行为。"
        },
        {
            "idiom": "惊心动魄",
            "explain": "原指作品文辞优美；使人感受极深；震动极大。后形容令人震惊、感动、紧张之极。"
        },
        {
            "idiom": "舟车劳顿",
            "explain": "舟车：船与车，泛指一切水陆交通工具。劳顿：劳累疲倦。形容旅途疲劳困顿。"
        },
        {
            "idiom": "张灯结彩",
            "explain": "挂上灯笼；系上彩绸。形容喜庆的景象。"
        },
        {
            "idiom": "七尺之躯",
            "explain": "躯：身体。成年男子的身躯"
        },
        {
            "idiom": "名满天下",
            "explain": "天下闻名。形容名声极大。"
        },
        {
            "idiom": "流芳百世",
            "explain": "流：流传；芳：花草的香气；比喻好的名声；百世：古人以30年为一世；形容极为久远的时间。美好的名声在后世永久流传。也作“流芳千古”。"
        },
        {
            "idiom": "不正之风",
            "explain": "不正当的社会风气。"
        },
        {
            "idiom": "一触即发",
            "explain": "触：碰。即：就。原指把箭扣在弦上；拉开弓等着射出去。比喻事态发展到了十分紧张的阶段；稍一触动就立即会爆发。"
        },
        {
            "idiom": "冷言冷语",
            "explain": "冷：不热；冷淡；不温和。不直接表达其意；从侧面或反面说辛辣嘲讽的话。"
        },
        {
            "idiom": "与虎谋皮",
            "explain": "和老虎商量；要它的皮。比喻跟有直接利害关系的人去商量损害他人利益的事；绝对办不到。后多指要恶人放弃自己的利益；纯属幻想。"
        },
        {
            "idiom": "目无全牛",
            "explain": "比喻技艺熟练到了得心应手的境界"
        },
        {
            "idiom": "穿针引线",
            "explain": "原指在男女之间进行的撮合；现常用来比喻从中联系、牵合、拉拢；使双方接通关系。"
        },
        {
            "idiom": "大刀阔斧",
            "explain": "大刀和阔斧都是古代的武器。原来形容军队声势浩大；杀气腾腾；充满战斗气氛。现比喻办事果断而有魄力。"
        },
        {
            "idiom": "义无反顾",
            "explain": "义：宜；应该做的事；反顾：回头看。做正当合理的事；只有上前的事；绝不回头。"
        },
        {
            "idiom": "霸王别姬",
            "explain": "形容英雄末路的悲壮情景。"
        },
        {
            "idiom": "鹤发童颜",
            "explain": "颜：面色。鹤发童颜：仙鹤羽毛般雪白的头发，儿童般红润的面色。形容老年人气色好。"
        },
        {
            "idiom": "伤风败俗",
            "explain": "伤：损伤；败：败坏。败坏社会风气。多用来谴责道德败坏的行为。"
        },
        {
            "idiom": "心血来潮",
            "explain": "指心里突然或偶然起了一个念头。来潮：潮水上涨。"
        },
        {
            "idiom": "刻不容缓",
            "explain": "刻：指短暂的时间；缓：延迟。指形势紧迫，一刻也不允许拖延。"
        },
        {
            "idiom": "阳关大道",
            "explain": "阳关：古关名；在今甘肃省敦煌市南。原指经过阳关通往西域的官道。后泛指通过便利交通大道和光明的道路。也比喻好的出路、办法。"
        },
        {
            "idiom": "前车之鉴",
            "explain": "前车：前面的车子；鉴：镜子。前面车子翻了的教训。比喻从前人的失败中得来的教训。"
        },
        {
            "idiom": "先发制人",
            "explain": "发：开始行动；制：制服。指争取主动；先动手来制服对方。现泛指先下手争取主动。"
        },
        {
            "idiom": "避实击虚",
            "explain": "虚：空虚。避开敌人的主力所在，攻击其防御薄弱之处"
        },
        {
            "idiom": "有声有色",
            "explain": "既有声音；又有色泽。形容表演或说话十分生动、精彩。"
        },
        {
            "idiom": "沾花惹草",
            "explain": "犹言沾风惹草。"
        },
        {
            "idiom": "青天白日",
            "explain": "指大白天。也比喻明显的事情或高洁的品德。"
        },
        {
            "idiom": "铤而走险",
            "explain": "指在无路可走的时候采取冒险行为。铤：快跑的样子；走险：奔赴险地。"
        },
        {
            "idiom": "损兵折将",
            "explain": "军士和将领都遭到损失。"
        },
        {
            "idiom": "南柯一梦",
            "explain": "南柯：朝南的树枝。指一场大梦；或比喻一场空欢喜。"
        },
        {
            "idiom": "大公无私",
            "explain": "一心为公；没有私心。也指处理事情公平正确；不偏袒任何一方。"
        },
        {
            "idiom": "两厢情愿",
            "explain": "两厢：双方；情愿：心里愿意。两方都愿意；互不勉强。也作“两相情愿”。"
        },
        {
            "idiom": "不识好歹",
            "explain": "歹：坏。不知道什么是好；什么是坏。"
        },
        {
            "idiom": "朝不保夕",
            "explain": "早晨不能保证晚上的情况。形容生活困难；也形容形势危急；难以预料。"
        },
        {
            "idiom": "蜚短流长",
            "explain": "指散播谣言，中伤他人。"
        },
        {
            "idiom": "登高望远",
            "explain": "登上高处，看得更远。也比喻思想境界高，目光远大。"
        },
        {
            "idiom": "称兄道弟",
            "explain": "朋友间以兄弟相称；表示关系亲密。"
        },
        {
            "idiom": "投其所好",
            "explain": "投合对方的爱好；有巴结讨好的意味。投：投合；迎合；好：爱好；喜好；所好：喜好的事物。"
        },
        {
            "idiom": "道高望重",
            "explain": "犹言德高望重。"
        },
        {
            "idiom": "问长问短",
            "explain": "仔细地问，表示关心。"
        },
        {
            "idiom": "腰缠万贯",
            "explain": "腰缠：随身携带；贯：钱串；古时穿钱用的绳索；一千文为贯。　形容钱财很多。"
        },
        {
            "idiom": "一语道破",
            "explain": "一句话就说穿（语：话；道：说）。比喻话说到了本质上或击中要害。"
        },
        {
            "idiom": "恶贯满盈",
            "explain": "恶：罪恶；贯：穿钱的绳子；每一千枚为一贯；盈：满。罪恶多得像穿钱一样；已经穿满了一贯还没完。形容罪大恶极已经到该受惩罚的时候了。"
        },
        {
            "idiom": "猫哭耗子",
            "explain": "比喻假慈悲，伪装同情"
        },
        {
            "idiom": "咬文嚼字",
            "explain": "指过分推敲字句；或讥讽迂腐不达事物；寻章搞句的人。"
        },
        {
            "idiom": "不由分说",
            "explain": "由：让；顺　随；分：辩别。不容许辩争。"
        },
        {
            "idiom": "称心如意",
            "explain": "称：符合；称心：符合心愿。完全符合心意。"
        },
        {
            "idiom": "过街老鼠",
            "explain": "比喻人人痛恨的坏人。"
        },
        {
            "idiom": "三位一体",
            "explain": "比喻三个人、三件事或三个方面联成一个整体。"
        },
        {
            "idiom": "心有余悸",
            "explain": "指可怕的事情虽已过去；心里还感到害怕。悸：因为害怕而心跳。"
        },
        {
            "idiom": "反败为胜",
            "explain": "扭转败局，变为胜利。"
        },
        {
            "idiom": "一气呵成",
            "explain": "呵：呼气。一口气做成。形容文章结构紧凑；文气连贯。也比喻做一件事安排紧凑；迅速不间断地完成。"
        },
        {
            "idiom": "心不在焉",
            "explain": "心思不在这里；指思想不集中。焉：古汉语助词；相当于“于此”。"
        },
        {
            "idiom": "除暴安良",
            "explain": "暴：暴徒；泛指给人民带来危害的人；安：安顺、安抚；良：善良的人；良民。除掉为非作歹的坏人；安抚善良的百姓。也作“安良除暴”。"
        },
        {
            "idiom": "灭顶之灾",
            "explain": "灭：淹灭；顶：头顶。像大水淹没了头顶一样的灾难。比喻致命的、毁灭性的灾难。"
        },
        {
            "idiom": "刀下留人",
            "explain": "为了营救即将被斩首的人而向主持或执行斩首的人发出的留人一命的紧急呼吁。"
        },
        {
            "idiom": "中西合璧",
            "explain": "璧：古代玉器。指兼有中国和外国优点的事物。"
        },
        {
            "idiom": "粉墨登场",
            "explain": "粉墨：搽脸和画眉的化妆品。指化装后登台演戏。比喻乔装打扮一番；登上政治舞台。也比喻在社会生活中扮演角色；像演戏一样活动。"
        },
        {
            "idiom": "水性杨花",
            "explain": "像流水那样易变；像杨花那样轻飘。旧时比喻妇女在感情上不专一；作风轻浮。"
        },
        {
            "idiom": "走南闯北",
            "explain": "指走过南方北方不少地方。也泛指闯荡。"
        },
        {
            "idiom": "万事如意",
            "explain": "如意：符合心意。一切都符合心意，很顺利"
        },
        {
            "idiom": "刮目相看",
            "explain": "去掉旧的看法；用新眼光看待。"
        },
        {
            "idiom": "精打细算",
            "explain": "精：精心；打：计划；规划；细：细密。精心地计划；详细地打算。指在生活或使用人力、物力上精心安排；不使其浪费。"
        },
        {
            "idiom": "飞沙走石",
            "explain": "飞：使飞扬；走：使滚动。沙土飞扬；石子滚动。形容风力极大。"
        },
        {
            "idiom": "金童玉女",
            "explain": "传说中服侍仙人；生有慧根的童男童女。泛指稚气无邪的男、女孩童。"
        },
        {
            "idiom": "礼尚往来",
            "explain": "尚：注重。在礼节上要注重有来有往。后也指你对我怎么样；我对你就怎么样。"
        },
        {
            "idiom": "如日中天",
            "explain": "比喻事物正发展到十分兴盛的阶段。"
        },
        {
            "idiom": "雨后春笋",
            "explain": "春雨以后；竹笋长得又多又快。比喻新生事物大量涌现蓬勃发展。"
        },
        {
            "idiom": "苦不堪言",
            "explain": "堪：能。苦痛至极；不能用言语来形容、表述。形容受苦极深。"
        },
        {
            "idiom": "偷梁换柱",
            "explain": "比喻暗中玩弄手法；以假代真；以劣代优。"
        },
        {
            "idiom": "敲山震虎",
            "explain": "见“敲山振虎”。"
        },
        {
            "idiom": "嫌贫爱富",
            "explain": "嫌：厌恶。嫌弃贫穷的；喜爱富有的。指对人的好恶不以德行；而以贫富为标准。"
        },
        {
            "idiom": "本性难移",
            "explain": "移：改变。本质难于改变。"
        },
        {
            "idiom": "不食烟火",
            "explain": "①指不吃熟食。道家修炼主张绝粒却谷，不吃世间烟火物。②指诗文立意"
        },
        {
            "idiom": "破釜沉舟",
            "explain": "釜：古代的一种锅；舟：船。砸碎锅子；凿沉船只。比喻战斗到底。"
        },
        {
            "idiom": "翻山越岭",
            "explain": "越：过；岭：顶上有路可通行的山。翻过很多山头；形容野外工作或行进途中辛苦。也比喻历尽千辛万苦。"
        },
        {
            "idiom": "铁面无私",
            "explain": "形容公正严明；不讲情面。铁面：比喻刚直无私。"
        },
        {
            "idiom": "鱼跃龙门",
            "explain": "同“鱼化龙”。"
        },
        {
            "idiom": "顺水推舟",
            "explain": "顺着水流的方向推船。比喻顺着某个趋势或某种方式说话办事。"
        },
        {
            "idiom": "棒打鸳鸯",
            "explain": "比喻拆散恩爱的夫妻或情侣。"
        },
        {
            "idiom": "三顾茅庐",
            "explain": "指诚心诚意地邀请、拜访有专长的贤人。"
        },
        {
            "idiom": "一言九鼎",
            "explain": "一句话的分量就有九鼎那么重。形容能起决定作用的言论或意见。"
        },
        {
            "idiom": "志同道合",
            "explain": "形容彼此志向相同；信仰、志趣一致。志：志向；道：道路；信仰。"
        },
        {
            "idiom": "杞人忧天",
            "explain": "杞：古时国名；忧天：担心天塌陷。杞国人担心天会塌下来；寝食不安。比喻不必要的或毫无根据的忧虑。"
        },
        {
            "idiom": "镜花水月",
            "explain": "镜子里的花；水中的月亮。比喻虚幻的景象。也用于比喻诗中不能从字面来理解的所谓空灵的意境。"
        },
        {
            "idiom": "粉饰太平",
            "explain": "粉饰：粉刷装饰；太平：社会平安兴旺。把黑暗混乱的社会局面装扮成太平盛世。"
        },
        {
            "idiom": "缚鸡之力",
            "explain": "缚：捆、绑。捆绑一只鸡的力量。形容体力很弱。"
        },
        {
            "idiom": "功高震主",
            "explain": "功：功劳，功勋；震：震动、威震；主：君主。功劳太大，使君主受到震动而心有疑虑。"
        },
        {
            "idiom": "口如悬河",
            "explain": "见“口若悬河”。"
        },
        {
            "idiom": "独木难支",
            "explain": "一根木头难以支撑起将要倒塌的大房子。比喻单薄的力量无法维持全局。"
        },
        {
            "idiom": "小家碧玉",
            "explain": "小户人家的女子；名字叫碧玉。后泛指小户人家年轻美貌的女子。"
        },
        {
            "idiom": "各有所长",
            "explain": "长：长处、优点。各有各的长处、优点。一般多指人才而言。"
        },
        {
            "idiom": "雾里看花",
            "explain": "原形容年老视力差，看东西模糊，后也比喻看事情不真切。"
        },
        {
            "idiom": "一字千金",
            "explain": "一字千金：增损一字；赏以千金。形容文辞精妙；不可更改。"
        },
        {
            "idiom": "青云直上",
            "explain": "青云：指青天。直线上升；向高空飞腾直上。比喻人的地位直线上升。"
        },
        {
            "idiom": "彻头彻尾",
            "explain": "彻：通；透。从头到尾；自始至终；完完全全。"
        },
        {
            "idiom": "牛刀小试",
            "explain": "牛刀：宰牛的刀。用宰牛刀在小生物身上做试验。比喻有大本领而先在小事上略微施展一下。"
        },
        {
            "idiom": "叫苦连天",
            "explain": "一声接一声地诉苦。"
        },
        {
            "idiom": "大手大脚",
            "explain": "①形容对财物毫不吝惜；没有节制地随便花费。②指行动鲁莽。③指身体强壮。"
        },
        {
            "idiom": "出水芙蓉",
            "explain": "芙蓉：荷花。刚露出水面的荷花。原比喻诗写得清新；后也形容女子的容貌清秀美丽。也作“芙蓉出水”。"
        },
        {
            "idiom": "闭月羞花",
            "explain": "闭月：指貂蝉的美貌把月亮比下。羞花：指杨贵妃的颜容使得花儿害羞地低下头，原与沉鱼落雁相连，形容我国古代四大美人的容貌倾国倾城，宛若天仙。指女子的容貌美丽。"
        },
        {
            "idiom": "一官半职",
            "explain": "一定的官衔职位。多指比较低微的头衔职称。"
        },
        {
            "idiom": "朝秦暮楚",
            "explain": "战国时期，秦楚两个诸侯大国相互对立，经常作战。有的诸侯小国为了自身的利益与安全，时而倾向秦，时而倾向楚。比喻人反复无常。"
        },
        {
            "idiom": "杀气腾腾",
            "explain": "杀气：凶恶的气势；腾腾：气势旺盛的样子。指杀伐之气很盛，凶神恶煞的样子。"
        },
        {
            "idiom": "鹬蚌相争",
            "explain": "“鹬蚌相争，渔翁得利”的省语。比喻双方相持不下，而使第三者从中得利。"
        },
        {
            "idiom": "神来之笔",
            "explain": "由神灵帮助而写出的作品。形容作品、文句精彩。"
        },
        {
            "idiom": "三年五载",
            "explain": "载：年。指三五年。形容不很长的几年时间。"
        },
        {
            "idiom": "歪风邪气",
            "explain": "指各种不良的作风和风气。邪：不正派；不正当。"
        },
        {
            "idiom": "抱头痛哭",
            "explain": "指十分伤心或感动，抱头大哭"
        },
        {
            "idiom": "草船借箭",
            "explain": "运用智谋，凭借他人的人力或财力来达到自己的目的。"
        },
        {
            "idiom": "虚位以待",
            "explain": "留着位置等待。"
        },
        {
            "idiom": "左顾右盼",
            "explain": "向左看看；向右望望。形容得意或警戒的神态。顾、盼：看；望。"
        },
        {
            "idiom": "鱼死网破",
            "explain": "不是鱼死；就是网破。指拼个你死我活。"
        },
        {
            "idiom": "面面俱到",
            "explain": "俱：都。各方面都照顾到。也指虽然各方面都照顾到；但重点不突出；很一般化。"
        },
        {
            "idiom": "债台高筑",
            "explain": "筑起很高的债务台。形容欠债很多。"
        },
        {
            "idiom": "打成一片",
            "explain": "原指形成一个整体。现多形容感情融洽，成为一体。"
        },
        {
            "idiom": "绳之以法",
            "explain": "绳：准绳；引申为制裁；之：代词代犯法的人；以：用；拿；法：法律；法令。用法律作准绳；给予制裁。"
        },
        {
            "idiom": "挤眉弄眼",
            "explain": "弄眼：使眼色。挤眉毛和眨眼睛向别人示意。也作“挤眉溜眼”。"
        },
        {
            "idiom": "横七竖八",
            "explain": "有的横着；有的竖着。形容杂乱无章；没有条理。"
        },
        {
            "idiom": "东躲西藏",
            "explain": "指到处躲避藏匿"
        },
        {
            "idiom": "久居人下",
            "explain": "现指处境或职务长期处于他人之下。"
        },
        {
            "idiom": "一板一眼",
            "explain": "比喻言语、行动有条理或合规矩。有时也比喻做事死板，不懂得灵活掌握。"
        },
        {
            "idiom": "五花大绑",
            "explain": "先用绳索套住脖子，又绕到背后反剪两臂的绑人方式。"
        },
        {
            "idiom": "名存实亡",
            "explain": "名义上还有；实际上已经不存在了。"
        },
        {
            "idiom": "口诛笔伐",
            "explain": "口：指言语；诛：责罚；笔：指文字。伐：征讨。用言语和文字揭露或批判罪行。"
        },
        {
            "idiom": "欢天喜地",
            "explain": "形容非常高兴、快乐。"
        },
        {
            "idiom": "千锤百炼",
            "explain": "锤：用锤子敲打；炼：用火烧炼。比喻经历多次艰苦斗争的锻炼和考验。也指对文章和作品进行多次精心的修改。"
        },
        {
            "idiom": "囫囵吞枣",
            "explain": "囫囵：整个儿；完整的。把枣整个咽下去，不加咀嚼，不辨滋味；比喻对事物不加分析思考，笼统地接受。"
        },
        {
            "idiom": "唇红齿白",
            "explain": "嘴唇红，牙齿白。形容人容貌俊美。"
        },
        {
            "idiom": "从长计议",
            "explain": "长：放长时间；计议：商议需要较长的时间；仔细地考虑；商量。指对事情处理时的慎重认真态度。"
        },
        {
            "idiom": "平起平坐",
            "explain": "平：没有高低；相同。原指封建时代地位相同的人同时站起；同时坐下。现比喻地位相同；权力相等。"
        },
        {
            "idiom": "尚方宝剑",
            "explain": "上方宝剑。比喻极大的权力"
        },
        {
            "idiom": "破绽百出",
            "explain": "绽：裂开；破绽：指衣服上的裂口。形容说话、做事漏洞很多。"
        },
        {
            "idiom": "两情相悦",
            "explain": "形容双方对彼此都有好感。"
        },
        {
            "idiom": "心想事成",
            "explain": "意指“心里想到的，都能成功”。该词多用于祝福语，是中性词。"
        },
        {
            "idiom": "密不透风",
            "explain": "形容包围紧密或防卫严密，连风也透不进去。"
        },
        {
            "idiom": "曲终人散",
            "explain": "鼓瑟之人一曲演罢，听客纷纷离去，江水依旧东流，峰峦叠起青山依旧。万事万物都有消亡的一刻，曲子停息了。人也就都散了。"
        },
        {
            "idiom": "十指连心",
            "explain": "十个指头连着心。表示身体的每个小部分都跟心有不可分的关系。比喻亲人跟自身休戚相关。"
        },
        {
            "idiom": "三朝元老",
            "explain": "元老：资格最老，声望最高的老臣。原指受三世皇帝重用的臣子。现在用来指在一个机构里长期工作过的资格老的人。"
        },
        {
            "idiom": "面壁思过",
            "explain": "过：指人犯了错误、有过失，对着墙来反省自己的错误、过失。"
        },
        {
            "idiom": "六六大顺",
            "explain": "表达民间希望生活 上各各领域都顺顺利利的意思。"
        },
        {
            "idiom": "三寸之舌",
            "explain": "比喻能说会辩的口才。"
        },
        {
            "idiom": "虎虎生风",
            "explain": "有虎啸风起的气势，口语，来自虎啸生风。完整说法“虎啸生风"
        },
        {
            "idiom": "卸甲归田",
            "explain": "解：脱下；甲：古代将士打仗时穿的硬质防护服。脱下军服，回家种地，指战士退伍还乡，现亦可引申为下岗。"
        },
        {
            "idiom": "喜结良缘",
            "explain": "美好的姻缘终于走到一起，用来祝福一对新人将要结婚。"
        },
        {
            "idiom": "衰兵必胜",
            "explain": "原意是力量相当的两军对阵，悲愤的一方获得胜利。后指因受欺侮而奋起抵抗的军队，必定能取胜。"
        },
        {
            "idiom": "不告而别",
            "explain": "告：告辞；别：离别。没有打招呼；就离开了；或悄悄地溜走了。"
        },
        {
            "idiom": "了然于心",
            "explain": "了然：明白，清楚。心里非常明白 。"
        },
        {
            "idiom": "手足情深",
            "explain": "：形容兄弟姐妹或朋友之间的感情好，感情深。 就好象是手足一样亲近，离不开，不可缺少那种。 "
        },
        {
            "idiom": "与时俱进",
            "explain": "准确把握时代特征，始终站在时代前列和实践前沿，始终坚持解放思想、实事求是和开拓进取，在大胆探索中继承发展。"
        },
        {
            "idiom": "风雨同路",
            "explain": "在狂风暴雨中同乘一条船,一起与风雨搏斗。比喻共同经历患难。"
        }
    ],
    "steps": [
        [
            146,
            31,
            68,
            657,
            718,
            973,
            567,
            310,
            385,
            344
        ],
        [
            213,
            815,
            92,
            621,
            662,
            784,
            1071,
            315,
            905,
            753
        ],
        [
            692,
            451,
            376,
            478,
            939,
            655,
            669,
            624,
            870,
            380
        ],
        [
            1140,
            1022,
            1048,
            110,
            528,
            505,
            358,
            293,
            470,
            804
        ],
        [
            854,
            927,
            477,
            574,
            760,
            835,
            131,
            603,
            710,
            21
        ],
        [
            586,
            417,
            1092,
            1050,
            1106,
            444,
            701,
            652,
            926,
            596
        ],
        [
            790,
            300,
            237,
            416,
            338,
            806,
            968,
            65,
            386,
            486
        ],
        [
            676,
            715,
            87,
            708,
            176,
            355,
            696,
            254,
            996,
            629
        ],
        [
            811,
            33,
            7,
            130,
            152,
            1138,
            1053,
            625,
            748,
            829
        ],
        [
            319,
            168,
            450,
            1090,
            90,
            743,
            459,
            833,
            154,
            774
        ],
        [
            511,
            566,
            1136,
            616,
            180,
            214,
            496,
            1084,
            177,
            1139
        ],
        [
            283,
            1002,
            977,
            271,
            359,
            289,
            1038,
            206,
            70,
            1108
        ],
        [
            911,
            611,
            202,
            321,
            740,
            670,
            295,
            626,
            895,
            503
        ],
        [
            435,
            1041,
            148,
            63,
            878,
            501,
            282,
            1119,
            667,
            914
        ],
        [
            553,
            792,
            325,
            243,
            1115,
            1027,
            141,
            1045,
            579,
            23
        ],
        [
            656,
            267,
            491,
            188,
            144,
            314,
            555,
            151,
            103,
            175
        ],
        [
            238,
            921,
            266,
            568,
            212,
            993,
            580,
            840,
            263,
            32
        ],
        [
            149,
            100,
            770,
            394,
            805,
            433,
            725,
            575,
            690,
            954
        ],
        [
            1122,
            119,
            1013,
            349,
            896,
            187,
            796,
            967,
            1095,
            52
        ],
        [
            548,
            427,
            20,
            296,
            605,
            1057,
            756,
            972,
            330,
            1128
        ],
        [
            729,
            104,
            487,
            83,
            22,
            724,
            821,
            631,
            367,
            388
        ],
        [
            371,
            163,
            495,
            739,
            610,
            1,
            992,
            153,
            246,
            538
        ],
        [
            1096,
            599,
            609,
            958,
            785,
            252,
            660,
            94,
            636,
            117
        ],
        [
            442,
            76,
            874,
            520,
            71,
            845,
            273,
            622,
            782,
            1012
        ],
        [
            49,
            229,
            797,
            354,
            1087,
            454,
            1126,
            228,
            864,
            313
        ],
        [
            700,
            323,
            521,
            172,
            242,
            787,
            744,
            517,
            66,
            253
        ],
        [
            964,
            533,
            362,
            906,
            327,
            1134,
            306,
            681,
            942,
            1040
        ],
        [
            328,
            820,
            1060,
            959,
            677,
            167,
            272,
            689,
            619,
            255
        ],
        [
            123,
            138,
            497,
            469,
            693,
            472,
            6,
            1064,
            778,
            234
        ],
        [
            277,
            763,
            279,
            868,
            931,
            1052,
            268,
            197,
            350,
            589
        ],
        [
            1118,
            632,
            1014,
            309,
            685,
            99,
            712,
            612,
            702,
            698
        ],
        [
            335,
            1124,
            733,
            668,
            830,
            406,
            508,
            439,
            324,
            50
        ],
        [
            396,
            658,
            747,
            951,
            224,
            80,
            275,
            640,
            1025,
            382
        ],
        [
            302,
            850,
            678,
            462,
            910,
            564,
            754,
            659,
            704,
            598
        ],
        [
            363,
            916,
            351,
            1072,
            661,
            420,
            1083,
            597,
            1085,
            772
        ],
        [
            569,
            42,
            1051,
            824,
            917,
            769,
            1056,
            336,
            171,
            653
        ],
        [
            588,
            717,
            11,
            36,
            476,
            1017,
            672,
            606,
            1144,
            399
        ],
        [
            832,
            510,
            705,
            531,
            518,
            788,
            713,
            498,
            570,
            135
        ],
        [
            256,
            644,
            869,
            524,
            918,
            827,
            646,
            675,
            838,
            37
        ],
        [
            812,
            97,
            1097,
            1036,
            15,
            671,
            888,
            791,
            1034,
            378
        ],
        [
            682,
            529,
            847,
            947,
            1070,
            375,
            976,
            402,
            494,
            446
        ],
        [
            134,
            961,
            591,
            340,
            991,
            515,
            329,
            737,
            648,
            408
        ],
        [
            1137,
            405,
            102,
            1129,
            615,
            887,
            64,
            771,
            55,
            577
        ],
        [
            460,
            1068,
            59,
            140,
            95,
            793,
            936,
            1042,
            461,
            673
        ],
        [
            184,
            291,
            278,
            860,
            274,
            182,
            166,
            1055,
            945,
            379
        ],
        [
            81,
            803,
            956,
            490,
            1039,
            74,
            822,
            219,
            601,
            93
        ],
        [
            109,
            261,
            2,
            333,
            938,
            1088,
            585,
            124,
            145,
            369
        ],
        [
            634,
            539,
            799,
            101,
            525,
            392,
            1077,
            332,
            930,
            935
        ],
        [
            542,
            1089,
            251,
            764,
            800,
            1080,
            1001,
            216,
            67,
            360
        ],
        [
            178,
            736,
            440,
            78,
            1127,
            1030,
            757,
            861,
            43,
            952
        ],
        [
            1073,
            156,
            288,
            1058,
            883,
            780,
            1047,
            298,
            559,
            899
        ],
        [
            773,
            970,
            1135,
            421,
            60,
            929,
            852,
            499,
            966,
            44
        ],
        [
            863,
            1059,
            401,
            974,
            150,
            474,
            259,
            732,
            684,
            985
        ],
        [
            851,
            139,
            1028,
            1099,
            165,
            1098,
            565,
            47,
            857,
            72
        ],
        [
            194,
            1076,
            169,
            429,
            69,
            257,
            775,
            116,
            1010,
            995
        ],
        [
            316,
            680,
            107,
            798,
            687,
            239,
            816,
            443,
            749,
            643
        ],
        [
            551,
            301,
            368,
            727,
            418,
            561,
            1009,
            393,
            320,
            834
        ],
        [
            389,
            409,
            181,
            34,
            294,
            366,
            885,
            147,
            217,
            890
        ],
        [
            1020,
            46,
            583,
            1044,
            397,
            876,
            590,
            192,
            550,
            468
        ],
        [
            10,
            607,
            666,
            504,
            373,
            317,
            88,
            912,
            1131,
            937
        ],
        [
            419,
            423,
            537,
            240,
            159,
            925,
            457,
            714,
            211,
            1049
        ],
        [
            750,
            136,
            500,
            984,
            372,
            223,
            853,
            699,
            777,
            1069
        ],
        [
            536,
            808,
            924,
            230,
            818,
            85,
            562,
            196,
            623,
            795
        ],
        [
            723,
            716,
            955,
            198,
            686,
            126,
            158,
            248,
            786,
            341
        ],
        [
            530,
            186,
            889,
            120,
            170,
            734,
            587,
            755,
            1117,
            541
        ],
        [
            1029,
            513,
            928,
            208,
            726,
            86,
            286,
            556,
            593,
            880
        ],
        [
            871,
            846,
            641,
            849,
            813,
            132,
            1065,
            73,
            200,
            218
        ],
        [
            534,
            1109,
            1003,
            779,
            4,
            430,
            988,
            353,
            106,
            249
        ],
        [
            161,
            190,
            241,
            260,
            1063,
            447,
            526,
            1019,
            307,
            400
        ],
        [
            572,
            649,
            1035,
            957,
            220,
            909,
            45,
            981,
            204,
            707
        ],
        [
            89,
            971,
            543,
            810,
            14,
            475,
            903,
            281,
            24,
            493
        ],
        [
            91,
            221,
            160,
            898,
            305,
            40,
            276,
            544,
            343,
            762
        ],
        [
            128,
            1018,
            751,
            980,
            365,
            843,
            1026,
            484,
            54,
            635
        ],
        [
            452,
            746,
            337,
            304,
            663,
            697,
            334,
            979,
            594,
            940
        ],
        [
            437,
            873,
            485,
            390,
            875,
            426,
            174,
            1101,
            837,
            650
        ],
        [
            258,
            877,
            691,
            761,
            789,
            735,
            560,
            129,
            563,
            303
        ],
        [
            82,
            370,
            923,
            481,
            1081,
            638,
            438,
            1043,
            17,
            998
        ],
        [
            404,
            322,
            613,
            62,
            155,
            226,
            415,
            432,
            458,
            1007
        ],
        [
            1125,
            1082,
            38,
            113,
            312,
            892,
            195,
            5,
            557,
            479
        ],
        [
            19,
            231,
            199,
            227,
            77,
            205,
            1123,
            1023,
            614,
            465
        ],
        [
            527,
            326,
            299,
            356,
            245,
            16,
            297,
            12,
            807,
            706
        ],
        [
            225,
            61,
            721,
            1110,
            428,
            57,
            75,
            1104,
            932,
            794
        ],
        [
            584,
            941,
            540,
            866,
            285,
            403,
            84,
            1113,
            466,
            183
        ],
        [
            891,
            730,
            1006,
            802,
            620,
            232,
            617,
            576,
            270,
            512
        ],
        [
            963,
            862,
            1116,
            856,
            339,
            471,
            703,
            549,
            445,
            709
        ],
        [
            654,
            688,
            994,
            1091,
            18,
            250,
            859,
            695,
            115,
            865
        ],
        [
            1100,
            244,
            51,
            39,
            904,
            488,
            986,
            858,
            464,
            969
        ],
        [
            578,
            456,
            516,
            210,
            331,
            571,
            604,
            233,
            933,
            1102
        ],
        [
            1132,
            157,
            943,
            28,
            377,
            361,
            581,
            412,
            978,
            56
        ],
        [
            522,
            381,
            720,
            882,
            907,
            27,
            1120,
            817,
            0,
            179
        ],
        [
            848,
            13,
            121,
            694,
            664,
            449,
            318,
            766,
            1094,
            674
        ],
        [
            118,
            453,
            25,
            741,
            831,
            483,
            1004,
            374,
            222,
            1066
        ],
        [
            1111,
            901,
            455,
            759,
            719,
            29,
            776,
            962,
            765,
            308
        ],
        [
            58,
            554,
            1054,
            987,
            201,
            492,
            357,
            872,
            1046,
            265
        ],
        [
            292,
            122,
            502,
            1103,
            855,
            595,
            600,
            384,
            480,
            999
        ],
        [
            758,
            1015,
            235,
            647,
            1011,
            982,
            618,
            767,
            127,
            207
        ],
        [
            989,
            547,
            111,
            642,
            143,
            473,
            1074,
            191,
            137,
            506
        ],
        [
            948,
            287,
            164,
            463,
            1033,
            413,
            630,
            162,
            1121,
            26
        ],
        [
            203,
            262,
            364,
            965,
            411,
            348,
            608,
            96,
            1008,
            879
        ],
        [
            1142,
            125,
            841,
            535,
            79,
            352,
            105,
            1075,
            383,
            215
        ],
        [
            1061,
            975,
            558,
            552,
            1079,
            902,
            3,
            828,
            311,
            633
        ],
        [
            953,
            745,
            886,
            407,
            1032,
            881,
            387,
            236,
            919,
            738
        ],
        [
            1037,
            342,
            950,
            1112,
            448,
            884,
            1114,
            482,
            1016,
            523
        ],
        [
            519,
            801,
            1005,
            425,
            768,
            742,
            894,
            908,
            280,
            628
        ],
        [
            53,
            1062,
            783,
            825,
            35,
            1031,
            290,
            489,
            431,
            1093
        ],
        [
            645,
            983,
            1021,
            731,
            842,
            997,
            1000,
            752,
            814,
            897
        ],
        [
            1024,
            922,
            819,
            809,
            1141,
            1067,
            844,
            98,
            839,
            422
        ],
        [
            173,
            546,
            410,
            913,
            944,
            1078,
            665,
            990,
            602,
            193
        ],
        [
            823,
            345,
            424,
            683,
            264,
            391,
            514,
            934,
            836,
            545
        ],
        [
            711,
            1130,
            960,
            284,
            346,
            639,
            395,
            436,
            1105,
            247
        ],
        [
            946,
            48,
            915,
            142,
            1143,
            1086,
            532,
            8,
            893,
            108
        ],
        [
            627,
            133,
            781,
            728,
            637,
            900,
            209,
            722,
            867,
            434
        ],
        [
            185,
            592,
            41,
            398,
            1133,
            573,
            949,
            30,
            189,
            582
        ],
        [
            1107,
            269,
            920,
            441,
            826,
            467,
            509,
            112,
            679,
            114
        ],
        [
            507,
            414,
            651,
            347,
            9
        ]
    ]
}